In [1]:
import pandas as pd

In [2]:
customer = pd.read_csv('customer.csv')

In [3]:
customer.head()
customer.drop(['First Name','Last Name'], axis=1, inplace = True)
customer.rename(columns = {'id':'Customer_id'},inplace=True)

In [4]:
customer.head()

,Customer_id,Name,Phone,Email,Address,Driving_licence
0,987673,Bidget Keaton,778-475-2740,bkeaton0@netvibes.com,4134 Jenifer Circle,Yes
1,352841,Roderigo Sends,865-535-4858,rsends1@elegantthemes.com,73 Kenwood Terrace,Yes
2,554593,Germain Metzig,782-318-0312,gmetzig2@discuz.net,94 Hoepker Hill,No
3,778711,Hattie Kevern,564-480-9848,hkevern3@nyu.edu,40 Valley Edge Circle,Yes
4,78932,Dorena Kingaby,370-179-1371,dkingaby4@printfriendly.com,13765 Petterle Circle,Yes

In [5]:
finance = pd.read_csv('finance.csv')

In [6]:
finance.rename(columns = {'Annual Income':'Income','Account Number':'Account_number'},inplace=True)

In [7]:
finance.head()

,Customer_id,SSN,Income,Credit_History,Account_number,Bank
0,987673,224-48-7837,19114.12,Good,6247488842,Chase
1,352841,477-90-5881,34847.84,Good,8017327721,Wells Fargo
2,554593,331-60-5414,143162.64,Good,1463973416,Bank of America
3,778711,180-88-7800,30689.89,Good,6120588712,Citigroup
4,78932,853-17-1579,4148862.00,Good,6663340180,TD Bank

In [8]:
finance['SSN'] = finance['SSN'].str.replace('-','')

In [9]:
agents = pd.read_csv('AGENTS.csv')

In [10]:
agents.head()

,Agent_ID,Name,Phone,Email,Salary
0,97444,Eolanda Tillerton,530-528-4376,etillerton0@nydailynews.com,512292
1,80340,Lynnell Pixton,297-990-1742,lpixton1@yellowbook.com,852715
2,6768,Brunhilda Smyley,611-265-3125,bsmyley2@topsy.com,547082
3,52121,Kaitlin Ruter,188-177-5814,kruter3@wikimedia.org,525745
4,85926,Joshuah Devas,820-918-3141,jdevas4@google.es,734363

In [11]:
loan = pd.read_csv('loan.csv')
loan.head()
loan.drop(['Loan_Amount_Term','Credit_History','Property_Area'],axis=1,inplace=True)
loan = loan.iloc[:55]

In [12]:
loan['Customer_id'] = loan['Customer_id'].astype(int)
loan['Tenure'] = loan['Tenure'].astype(int)

In [13]:
loan.dtypes

Loan_ID               object
LoanAmount ('000)    float64
Customer_id            int64
Tenure                 int64
LoanType              object
dtype: object

In [14]:
loan['Customer_id'] = loan['Customer_id'].astype(str)
loan['Tenure'] = loan['Tenure'].astype(str)

In [15]:
loan.rename(columns = {"LoanAmount ('000)":"LoanAmount"},inplace=True)

In [16]:
loan['LoanAmount'] = loan['LoanAmount']*1000

In [17]:
loan.head()

    Loan_ID  LoanAmount Customer_id Tenure LoanType
0  LP001015    110000.0      987673     30     Home
1  LP001022    126000.0      987673     30  Vehicle
2  LP001031    208000.0      352841     30     Home
3  LP001035    100000.0      554593     30     Home
4  LP001051     78000.0      554593     30     Home

In [18]:
# from mysql.connector import connect, Error
# from getpass import getpass

In [19]:
# try:
#     conn = connect (
#        host = 'localhost',
#        username = input('Enter your username'),
#        password = input('Enter your password'),
#        database = 'insurit'
#     )
# except Error as e:
#     print(e)

In [20]:
# cursor = conn.cursor()

In [21]:
for Agent_ID, Name, Phone, Email, Salary in agents.values.tolist():
    print("INSERT INTO Agents VALUES ({}, '{}', '{}', '{}', {});".format(Agent_ID, Name, Phone, Email, Salary))

INSERT INTO Agents VALUES (97444, 'Eolanda Tillerton', '530-528-4376', 'etillerton0@nydailynews.com', 512292);
INSERT INTO Agents VALUES (80340, 'Lynnell Pixton', '297-990-1742', 'lpixton1@yellowbook.com', 852715);
INSERT INTO Agents VALUES (6768, 'Brunhilda Smyley', '611-265-3125', 'bsmyley2@topsy.com', 547082);
INSERT INTO Agents VALUES (52121, 'Kaitlin Ruter', '188-177-5814', 'kruter3@wikimedia.org', 525745);
INSERT INTO Agents VALUES (85926, 'Joshuah Devas', '820-918-3141', 'jdevas4@google.es', 734363);
INSERT INTO Agents VALUES (73812, 'Bertha Gibbe', '688-502-8799', 'bgibbe5@mapquest.com', 820523);
INSERT INTO Agents VALUES (95189, 'Stefa Cours', '882-723-7290', 'scours6@odnoklassniki.ru', 755473);
INSERT INTO Agents VALUES (92085, 'Erinn Minchindon', '436-379-1334', 'eminchindon7@theatlantic.com', 318714);
INSERT INTO Agents VALUES (92900, 'Rhonda Mayhead', '881-274-4756', 'rmayhead8@bloomberg.com', 400885);
INSERT INTO Agents VALUES (69259, 'Bonnibelle Manchett', '839-488-0561', 'bmanchett9@buzzfeed.com', 552776);
INSERT INTO Agents VALUES (13041, 'Raddie Basson', '560-368-3460', 'rbassona@psu.edu', 300977);
INSERT INTO Agents VALUES (78600, 'Veronika Pestricke', '832-194-4030', 'vpestrickeb@hhs.gov', 295584);
INSERT INTO Agents VALUES (33645, 'Worden Rosedale', '342-776-4301', 'wrosedalec@over-blog.com', 163238);
INSERT INTO Agents VALUES (47590, 'Windy Abden', '682-657-9610', 'wabdend@sbwire.com', 888306);
INSERT INTO Agents VALUES (54342, 'Gordon Darrel', '454-219-8925', 'gdarrele@businesswire.com', 561510);
INSERT INTO Agents VALUES (74988, 'Jess Sheavills', '812-721-0400', 'jsheavillsf@shop-pro.jp', 830578);
INSERT INTO Agents VALUES (39178, 'Johnette Haller', '774-832-1487', 'jhallerg@ebay.com', 152279);
INSERT INTO Agents VALUES (30720, 'Gabriella Baitey', '115-639-0792', 'gbaiteyh@wikipedia.org', 849936);
INSERT INTO Agents VALUES (4629, 'Shea Scrowton', '242-123-8721', 'sscrowtoni@plala.or.jp', 579882);
INSERT INTO Agents VALUES (96845, 'Juana Burberow', '993-581-2133', 'jburberowj@illinois.edu', 708124);
INSERT INTO Agents VALUES (66218, 'Ezra Georger', '286-372-2813', 'egeorgerk@ow.ly', 512072);
INSERT INTO Agents VALUES (97840, 'Nert Stockill', '666-702-4417', 'nstockilll@theguardian.com', 219810);
INSERT INTO Agents VALUES (35917, 'Faina Spring', '793-203-8997', 'fspringm@newyorker.com', 402620);
INSERT INTO Agents VALUES (49539, 'Creigh Phlippi', '380-624-9586', 'cphlippin@google.cn', 292520);
INSERT INTO Agents VALUES (80633, 'Annalee Esp', '294-763-5480', 'aespo@ftc.gov', 345017);
INSERT INTO Agents VALUES (92786, 'Hayyim Niave', '235-911-9074', 'hniavep@printfriendly.com', 612290);
INSERT INTO Agents VALUES (68833, 'Reider Plows', '346-360-7174', 'rplowsq@goo.gl', 290837);
INSERT INTO Agents VALUES (71268, 'Oliver Heaney', '700-767-1280', 'oheaneyr@umich.edu', 784328);
INSERT INTO Agents VALUES (80048, 'Quent Beeble', '490-514-1132', 'qbeebles@squarespace.com', 402270);
INSERT INTO Agents VALUES (31957, 'Lesli Couronne', '548-508-9555', 'lcouronnet@dedecms.com', 835102);
INSERT INTO Agents VALUES (88459, 'Sayres Polglaze', '169-510-7179', 'spolglazeu@hp.com', 625865);
INSERT INTO Agents VALUES (58102, 'Grantley Livingston', '324-862-1801', 'glivingstonv@bizjournals.com', 745480);
INSERT INTO Agents VALUES (125, 'Amelina Swinyard', '890-432-6030', 'aswinyardw@topsy.com', 402048);
INSERT INTO Agents VALUES (56777, 'Felicia Maxworthy', '279-934-5400', 'fmaxworthyx@ycombinator.com', 585696);
INSERT INTO Agents VALUES (11119, 'Annice Trewhella', '479-720-1862', 'atrewhellay@delicious.com', 706300);
INSERT INTO Agents VALUES (66624, 'Keir Swallwell', '906-651-8207', 'kswallwellz@shop-pro.jp', 693586);
INSERT INTO Agents VALUES (95587, 'Jobina Toor', '618-787-6209', 'jtoor10@w3.org', 158833);
INSERT INTO Agents VALUES (46129, 'Madlen D'Agostini', '656-131-0352', 'mdagostini11@wikia.com', 275629);
INSERT INTO Agents VALUES (62599, 'Forster Manntschke', '635-505-4502', 'fmanntschke12@paypal.com', 760910);
INSERT INTO Agents VALUES (38302, 'Florencia Coppard', '872-211-7033', 'fcoppard13@comcast.net', 234042);
INSERT INTO Agents VALUES (62068, 'Cherish Dyball', '938-934-3347', 'cdyball14@squidoo.com', 870681);
INSERT INTO Agents VALUES (76607, 'Kelvin Rekes', '999-647-8148', 'krekes15@storify.com', 497158);
INSERT INTO Agents VALUES (2340, 'Eddie Gimson', '672-601-2701', 'egimson16@de.vu', 387427);
INSERT INTO Agents VALUES (85484, 'Danyelle Trebilcock', '653-438-5978', 'dtrebilcock17@goodreads.com', 412469);
INSERT INTO Agents VALUES (27853, 'Chryste Windmill', '906-939-2362', 'cwindmill18@indiatimes.com', 729213);
INSERT INTO Agents VALUES (16339, 'Wildon Vaudre', '151-421-6581', 'wvaudre19@hatena.ne.jp', 174887);
INSERT INTO Agents VALUES (24998, 'Englebert Stenton', '317-998-9059', 'estenton1a@pcworld.com', 627117);
INSERT INTO Agents VALUES (47781, 'Anthiathia Rickersey', '325-295-6499', 'arickersey1b@howstuffworks.com', 647817);
INSERT INTO Agents VALUES (39992, 'Konstance Mariotte', '375-920-3091', 'kmariotte1c@webeden.co.uk', 780748);
INSERT INTO Agents VALUES (31487, 'Cairistiona Reardon', '979-143-2164', 'creardon1d@eepurl.com', 737356);

In [22]:
for Customer_id, Name, Phone, Email, Address, Driving_licence in customer.values.tolist():
    print("INSERT INTO Customer VALUES ({}, '{}', '{}', '{}', '{}', '{}');".format(Customer_id, Name, Phone, Email, Address, Driving_licence))

INSERT INTO Customer VALUES (987673, 'Bidget Keaton', '778-475-2740', 'bkeaton0@netvibes.com', '4134 Jenifer Circle', 'Yes');
INSERT INTO Customer VALUES (352841, 'Roderigo Sends', '865-535-4858', 'rsends1@elegantthemes.com', '73 Kenwood Terrace', 'Yes');
INSERT INTO Customer VALUES (554593, 'Germain Metzig', '782-318-0312', 'gmetzig2@discuz.net', '94 Hoepker Hill', 'No');
INSERT INTO Customer VALUES (778711, 'Hattie Kevern', '564-480-9848', 'hkevern3@nyu.edu', '40 Valley Edge Circle', 'Yes');
INSERT INTO Customer VALUES (78932, 'Dorena Kingaby', '370-179-1371', 'dkingaby4@printfriendly.com', '13765 Petterle Circle', 'Yes');
INSERT INTO Customer VALUES (319355, 'Leda Liffe', '768-317-1479', 'lliffe5@sun.com', '17870 Oxford Plaza', 'Yes');
INSERT INTO Customer VALUES (719439, 'Hailey Titchener', '160-664-3603', 'htitchener6@cnet.com', '33085 Meadow Vale Way', 'Yes');
INSERT INTO Customer VALUES (538409, 'Alyse Volleth', '977-218-2551', 'avolleth7@hhs.gov', '10 Kipling Court', 'No');
INSERT INTO Customer VALUES (979749, 'Thalia Raitie', '846-557-5060', 'traitie8@comcast.net', '3 Melody Circle', 'No');
INSERT INTO Customer VALUES (640537, 'Constanta Beresfore', '453-864-6762', 'cberesfore9@cargocollective.com', '35432 Charing Cross Avenue', 'No');
INSERT INTO Customer VALUES (871428, 'Elfreda Callander', '143-883-7368', 'ecallandera@gnu.org', '8828 Forest Run Avenue', 'No');
INSERT INTO Customer VALUES (847339, 'Brittney Mash', '690-401-9216', 'bmashb@nationalgeographic.com', '24753 Walton Trail', 'Yes');
INSERT INTO Customer VALUES (94613, 'Cassandra Veitch', '312-814-1819', 'cveitchc@cbslocal.com', '850 Monument Avenue', 'Yes');
INSERT INTO Customer VALUES (628418, 'Sianna Scay', '128-774-9848', 'sscayd@nps.gov', '9230 Waxwing Hill', 'Yes');
INSERT INTO Customer VALUES (974101, 'Carlo Grimm', '786-476-8508', 'cgrimme@house.gov', '601 Upham Center', 'Yes');
INSERT INTO Customer VALUES (930301, 'Hoebart Guidone', '751-282-1295', 'hguidonef@hubpages.com', '78 Thompson Hill', 'No');
INSERT INTO Customer VALUES (915790, 'Erina Neligan', '755-787-5609', 'eneligang@delicious.com', '7 Summit Trail', 'Yes');
INSERT INTO Customer VALUES (389080, 'Maurita Kleinplatz', '152-738-5550', 'mkleinplatzh@vimeo.com', '69920 Golf View Terrace', 'No');
INSERT INTO Customer VALUES (336850, 'Arda Calderhead', '139-697-7506', 'acalderheadi@indiatimes.com', '736 Sauthoff Point', 'Yes');
INSERT INTO Customer VALUES (176254, 'Correna Stitch', '602-865-3223', 'cstitchj@tripod.com', '15296 Bartillon Park', 'Yes');
INSERT INTO Customer VALUES (638484, 'Angie Attow', '343-925-7380', 'aattowk@mapy.cz', '05 Summerview Junction', 'Yes');
INSERT INTO Customer VALUES (621200, 'Augie Chene', '745-190-9290', 'achenel@omniture.com', '766 4th Parkway', 'Yes');
INSERT INTO Customer VALUES (555849, 'Rochette Dowglass', '231-251-7850', 'rdowglassm@exblog.jp', '7906 Marcy Place', 'Yes');
INSERT INTO Customer VALUES (972654, 'Berkly O'Glessane', '326-742-8192', 'boglessanen@chicagotribune.com', '42236 Clove Plaza', 'Yes');
INSERT INTO Customer VALUES (492977, 'Darb Tomsen', '658-767-5430', 'dtomseno@mashable.com', '31 Forest Run Alley', 'No');
INSERT INTO Customer VALUES (77471, 'Guthrie Cortese', '770-414-1691', 'gcortesep@about.com', '0077 Sheridan Drive', 'No');
INSERT INTO Customer VALUES (289060, 'Aundrea Abrahmer', '470-635-1811', 'aabrahmerq@yelp.com', '600 Haas Terrace', 'No');
INSERT INTO Customer VALUES (166248, 'Gisela Kretchmer', '668-244-2155', 'gkretchmerr@list-manage.com', '64 Pawling Way', 'No');
INSERT INTO Customer VALUES (830875, 'Hendrika Keynes', '174-384-6234', 'hkeyness@businessinsider.com', '1 Sommers Way', 'No');
INSERT INTO Customer VALUES (591642, 'Derrick Vowells', '336-654-2002', 'dvowellst@cyberchimps.com', '77236 Hazelcrest Trail', 'No');
INSERT INTO Customer VALUES (293654, 'Thomasin Boddymead', '867-190-2098', 'tboddymeadu@domainmarket.com', '618 Hanover Street', 'Yes');
INSERT INTO Customer VALUES (532909, 'Flo Mackett', '412-351-4643', 'fmackettv@princeton.edu', '06 Longview Street', 'Yes');
INSERT INTO Customer VALUES (109075, 'Darrel Gounot', '993-434-7131', 'dgounotw@gizmodo.com', '4 West Way', 'Yes');
INSERT INTO Customer VALUES (174408, 'Harri Paolo', '790-698-5891', 'hpaolox@marriott.com', '3 Cordelia Center', 'No');
INSERT INTO Customer VALUES (632251, 'Bendicty Gogay', '162-986-3633', 'bgogayy@toplist.cz', '164 Forest Plaza', 'Yes');
INSERT INTO Customer VALUES (981115, 'Antonius Freschini', '600-340-9348', 'afreschiniz@behance.net', '610 Transport Parkway', 'Yes');
INSERT INTO Customer VALUES (58082, 'Alfred Balshen', '140-400-3125', 'abalshen10@bloglines.com', '0 Glendale Parkway', 'Yes');
INSERT INTO Customer VALUES (499661, 'Edy Toulamain', '302-814-3607', 'etoulamain11@irs.gov', '17892 Fairview Junction', 'No');
INSERT INTO Customer VALUES (950610, 'Hilary Pockett', '278-453-0517', 'hpockett12@dailymail.co.uk', '3323 International Road', 'Yes');
INSERT INTO Customer VALUES (358893, 'Kara-lynn Dallaway', '579-654-3410', 'kdallaway13@bbc.co.uk', '4 Milwaukee Park', 'Yes');
INSERT INTO Customer VALUES (867938, 'Ricki Rayner', '643-725-5750', 'rrayner14@alexa.com', '956 Loftsgordon Point', 'Yes');
INSERT INTO Customer VALUES (114971, 'Reeva Kupisz', '300-253-6630', 'rkupisz15@moonfruit.com', '6910 Bluestem Park', 'Yes');
INSERT INTO Customer VALUES (365390, 'Wilfred Joel', '632-327-2233', 'wjoel16@whitehouse.gov', '450 Beilfuss Junction', 'Yes');
INSERT INTO Customer VALUES (872585, 'Karilynn Seymour', '207-292-0041', 'kseymour17@blogtalkradio.com', '2 East Parkway', 'Yes');
INSERT INTO Customer VALUES (144402, 'Dasha Hiscoe', '262-608-3656', 'dhiscoe18@livejournal.com', '6 Northfield Drive', 'No');
INSERT INTO Customer VALUES (345273, 'Josee Honeywood', '223-375-2439', 'jhoneywood19@engadget.com', '6048 Spaight Parkway', 'No');
INSERT INTO Customer VALUES (415216, 'Nonnah Trass', '370-533-6961', 'ntrass1a@apache.org', '46327 Ludington Place', 'No');
INSERT INTO Customer VALUES (733572, 'Dmitri Simmen', '228-899-5566', 'dsimmen1b@hibu.com', '505 Gateway Street', 'No');
INSERT INTO Customer VALUES (74341, 'Cello Fassan', '467-460-7623', 'cfassan1c@google.com.br', '70873 Ludington Court', 'No');
INSERT INTO Customer VALUES (249650, 'Curry Riggs', '895-961-5847', 'criggs1d@independent.co.uk', '3 Spenser Hill', 'No');

In [23]:
for Customer_id, SSN, Income,Credit_History,Account_number,Bank in finance.values.tolist():
    print("INSERT INTO Finance_details VALUES ({}, {}, '{}', {}, '{}', '{}');".format(SSN,Customer_id,Account_number,Income,Bank,Credit_History))

INSERT INTO Finance_details VALUES (224487837, 987673, '6247488842', 19114.12, 'Chase', 'Good');
INSERT INTO Finance_details VALUES (477905881, 352841, '8017327721', 34847.84, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (331605414, 554593, '1463973416', 143162.64, 'Bank of America', 'Good');
INSERT INTO Finance_details VALUES (180887800, 778711, '6120588712', 30689.89, 'Citigroup', 'Good');
INSERT INTO Finance_details VALUES (853171579, 78932, '6663340180', 4148862.0, 'TD Bank', 'Good');
INSERT INTO Finance_details VALUES (101113105, 319355, '1590610819', 35547.71, 'Chase', 'Standard');
INSERT INTO Finance_details VALUES (716354628, 719439, '7489280966', 73928.46, 'Wells Fargo', 'Standard');
INSERT INTO Finance_details VALUES (908690212, 538409, '3385123187', 131313.4, 'Bank of America', 'Standard');
INSERT INTO Finance_details VALUES (744117914, 979749, '7821448415', 34081.38, 'Citigroup', 'Good');
INSERT INTO Finance_details VALUES (423776457, 640537, '4070604401', 114838.41, 'TD Bank', 'Good');
INSERT INTO Finance_details VALUES (507344117, 871428, '1293729161', 31370.8, 'Chase', 'Good');
INSERT INTO Finance_details VALUES (794174490, 847339, '1405124237', 33751.27, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (226770587, 94613, '3433461290', 88640.24, 'Bank of America', 'Good');
INSERT INTO Finance_details VALUES (389894542, 628418, '8594077125', 54392.16, 'Citigroup', 'Bad');
INSERT INTO Finance_details VALUES (761113016, 974101, '4373764648', 8701.545, 'TD Bank', 'Bad');
INSERT INTO Finance_details VALUES (147766929, 930301, '5062457584', 25546.26, 'Chase', 'Bad');
INSERT INTO Finance_details VALUES (878906321, 915790, '2633498674', 31993.78, 'Wells Fargo', 'Standard');
INSERT INTO Finance_details VALUES (616368188, 389080, '2607184695', 92047.08, 'Bank of America', 'Standard');
INSERT INTO Finance_details VALUES (496445947, 336850, '4738448888', 92047.08, 'Citigroup', 'Standard');
INSERT INTO Finance_details VALUES (405467599, 176254, '5316421672', 32284.62, 'TD Bank', 'Good');
INSERT INTO Finance_details VALUES (755180308, 638484, '5110480157', 97791.42, 'Chase', 'Good');
INSERT INTO Finance_details VALUES (547237195, 621200, '8889194720', 19300.34, 'Wells Fargo', 'Bad');
INSERT INTO Finance_details VALUES (486071289, 555849, '8404188141', 19514.88, 'Bank of America', 'Bad');
INSERT INTO Finance_details VALUES (605639678, 972654, '3995617909', 10183.015, 'Citigroup', 'Bad');
INSERT INTO Finance_details VALUES (558251337, 492977, '2005036558', 10183.015, 'TD Bank', 'Good');
INSERT INTO Finance_details VALUES (813918749, 77471, '6239350355', 106733.13, 'Chase', 'Good');
INSERT INTO Finance_details VALUES (308388791, 289060, '8898570629', 12600.445, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (925441671, 166248, '4674612116', 57983.12, 'Bank of America', 'Bad');
INSERT INTO Finance_details VALUES (548039919, 830875, '3497327023', 20787.69, 'Citigroup', 'Bad');
INSERT INTO Finance_details VALUES (251770979, 591642, '9144957778', 34290.12, 'TD Bank', 'Bad');
INSERT INTO Finance_details VALUES (898940497, 293654, '7482284503', 43070.24, 'Chase', 'Standard');
INSERT INTO Finance_details VALUES (992492793, 532909, '7884101536', 28572.39, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (352674436, 109075, '4450371309', 39641.54, 'Bank of America', 'Good');
INSERT INTO Finance_details VALUES (204142702, 174408, '7788575072', 20186.02, 'Citigroup', 'Good');
INSERT INTO Finance_details VALUES (755517133, 632251, '9174445104', 18627.64, 'TD Bank', 'Standard');
INSERT INTO Finance_details VALUES (837455178, 981115, '6144703129', 12986.745, 'Chase', 'Standard');
INSERT INTO Finance_details VALUES (074216507, 58082, '6668080649', 58317.0, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (772589547, 499661, '1702237609', 42171.98, 'Bank of America', 'Standard');
INSERT INTO Finance_details VALUES (835416871, 950610, '7899232129', 71681.4, 'Citigroup', 'Standard');
INSERT INTO Finance_details VALUES (330960638, 358893, '8296876239', 71681.4, 'TD Bank', 'Standard');
INSERT INTO Finance_details VALUES (397455329, 867938, '6898823636', 29469.98, 'Chase', 'Standard');
INSERT INTO Finance_details VALUES (212322085, 114971, '1631204329', 29469.98, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (087226137, 365390, '5461846948', 72559.36, 'Bank of America', 'Standard');
INSERT INTO Finance_details VALUES (062293192, 872585, '3442289093', 15566.02, 'Citigroup', 'Good');
INSERT INTO Finance_details VALUES (727409990, 144402, '6158965543', 66567.32, 'TD Bank', 'Good');
INSERT INTO Finance_details VALUES (016732103, 345273, '5264379216', 12909.895, 'Chase', 'Good');
INSERT INTO Finance_details VALUES (198089791, 415216, '3321119986', 20601508.0, 'Wells Fargo', 'Good');
INSERT INTO Finance_details VALUES (518012262, 733572, '3546730823', 30788.44, 'Bank of America', 'Standard');
INSERT INTO Finance_details VALUES (465939571, 74341, '2475885785', 30788.44, 'Citigroup', 'Standard');
INSERT INTO Finance_details VALUES (860361556, 249650, '1238315826', 20574.47, 'TD Bank', 'Standard');

In [24]:
for Loan_ID,LoanAmount,Customer_id,Tenure,LoanType in loan.values.tolist():
    print("INSERT INTO Loan VALUES ('{}','{}',{},{},{});".format(Loan_ID,LoanType,Tenure,LoanAmount,Customer_id))

INSERT INTO Loan VALUES ('LP001015','Home',30,110000.0,987673);
INSERT INTO Loan VALUES ('LP001022','Vehicle',30,126000.0,987673);
INSERT INTO Loan VALUES ('LP001031','Home',30,208000.0,352841);
INSERT INTO Loan VALUES ('LP001035','Home',30,100000.0,554593);
INSERT INTO Loan VALUES ('LP001051','Home',30,78000.0,554593);
INSERT INTO Loan VALUES ('LP001054','Home',30,152000.0,554593);
INSERT INTO Loan VALUES ('LP001055','Home',30,59000.0,778711);
INSERT INTO Loan VALUES ('LP001056','Vehicle',30,147000.0,78932);
INSERT INTO Loan VALUES ('LP001059','Home',20,280000.0,319355);
INSERT INTO Loan VALUES ('LP001067','Home',30,123000.0,719439);
INSERT INTO Loan VALUES ('LP001078','Vehicle',30,90000.0,538409);
INSERT INTO Loan VALUES ('LP001082','Home',30,162000.0,538409);
INSERT INTO Loan VALUES ('LP001083','Home',15,40000.0,979749);
INSERT INTO Loan VALUES ('LP001094','Vehicle',30,166000.0,979749);
INSERT INTO Loan VALUES ('LP001096','Vehicle',30,124000.0,979749);
INSERT INTO Loan VALUES ('LP001099','Vehicle',30,131000.0,640537);
INSERT INTO Loan VALUES ('LP001105','Vehicle',30,200000.0,94613);
INSERT INTO Loan VALUES ('LP001107','Vehicle',30,126000.0,628418);
INSERT INTO Loan VALUES ('LP001108','Vehicle',30,300000.0,974101);
INSERT INTO Loan VALUES ('LP001115','Vehicle',15,100000.0,930301);
INSERT INTO Loan VALUES ('LP001121','Home',30,48000.0,176254);
INSERT INTO Loan VALUES ('LP001124','Home',15,28000.0,176254);
INSERT INTO Loan VALUES ('LP001128','Home',30,101000.0,176254);
INSERT INTO Loan VALUES ('LP001135','Home',30,125000.0,555849);
INSERT INTO Loan VALUES ('LP001149','Home',30,290000.0,555849);
INSERT INTO Loan VALUES ('LP001153','Home',30,148000.0,289060);
INSERT INTO Loan VALUES ('LP001163','Home',30,140000.0,166248);
INSERT INTO Loan VALUES ('LP001169','Home',30,275000.0,830875);
INSERT INTO Loan VALUES ('LP001174','Vehicle',30,57000.0,591642);
INSERT INTO Loan VALUES ('LP001176','Vehicle',15,125000.0,293654);
INSERT INTO Loan VALUES ('LP001177','Home',30,75000.0,58082);
INSERT INTO Loan VALUES ('LP001183','Home',30,192000.0,58082);
INSERT INTO Loan VALUES ('LP001185','Home',30,152000.0,950610);
INSERT INTO Loan VALUES ('LP001187','Home',30,158000.0,358893);
INSERT INTO Loan VALUES ('LP001190','Home',30,101000.0,114971);
INSERT INTO Loan VALUES ('LP001203','Vehicle',30,176000.0,114971);
INSERT INTO Loan VALUES ('LP001208','Vehicle',15,185000.0,114971);
INSERT INTO Loan VALUES ('LP001210','Vehicle',30,90000.0,365390);
INSERT INTO Loan VALUES ('LP001211','Vehicle',30,116000.0,872585);
INSERT INTO Loan VALUES ('LP001219','Vehicle',30,138000.0,144402);
INSERT INTO Loan VALUES ('LP001220','Home',30,100000.0,733572);
INSERT INTO Loan VALUES ('LP001221','Home',30,110000.0,733572);
INSERT INTO Loan VALUES ('LP001226','Home',30,90000.0,733572);
INSERT INTO Loan VALUES ('LP001230','Home',30,200000.0,249650);
INSERT INTO Loan VALUES ('LP001231','Home',30,84000.0,249650);
INSERT INTO Loan VALUES ('LP001232','Home',0,185000.0,249650);
INSERT INTO Loan VALUES ('LP001237','Home',30,162000.0,249650);
INSERT INTO Loan VALUES ('LP001242','Home',30,108000.0,499661);
INSERT INTO Loan VALUES ('LP001268','Home',0,187000.0,499661);
INSERT INTO Loan VALUES ('LP001270','Home',30,187000.0,638484);
INSERT INTO Loan VALUES ('LP001284','Home',30,124000.0,621200);
INSERT INTO Loan VALUES ('LP001287','Home',30,120000.0,621200);
INSERT INTO Loan VALUES ('LP001291','Home',30,160000.0,621200);
INSERT INTO Loan VALUES ('LP001298','Home',15,30000.0,847339);
INSERT INTO Loan VALUES ('LP001312','Vehicle',30,92000.0,847339);

In [25]:
auto = pd.read_csv('auto_policy_detail.csv')

In [26]:
auto.head()

,Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure_in_months,Policy_type
0,111,Comprehensive Car Care,Sedan,This policy covers all types of sedans and off...,Active,50000,12,Auto
1,112,Off-Road Adventure Shield,SUV,"Designed for SUVs and off-road vehicles, this ...",Active,70000,24,Auto
2,113,Oriental Motor Plan,Motorbike,"Tailored for motorcycles, this policy covers d...",Active,30000,12,Auto
3,114,Classic Car Elegance,Vintage Cars,"Geared towards vintage and classic cars, this ...",Inactive,100000,60,Auto
4,115,Electric Vehicle EcoShield,Electric Cars,"Tailored for electric cars, this policy covers...",Active,60000,24,Auto

In [27]:
for Policy_id, Name, Type,Description,Policy_active_flag, Sum_assured, Tenure_in_months, Policy_type in auto.values.tolist():
    print("INSERT INTO AutoPolicy_detail VALUES ({},'{}','{}','{}','{}',{},{},'{}');".format(Policy_id, Name, Type,Description,Policy_active_flag, Sum_assured, Tenure_in_months, Policy_type))

INSERT INTO AutoPolicy_detail VALUES (111,'Comprehensive Car Care','Sedan','This policy covers all types of sedans and offers comprehensive protection, including coverage for accidents, theft, natural disasters, and medical expenses.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (112,'Off-Road Adventure Shield','SUV','Designed for SUVs and off-road vehicles, this policy provides specialized coverage for damages incurred during off-road adventures, including collisions, rollovers, and towing expenses.','Active',70000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (113,'Oriental Motor Plan','Motorbike','Tailored for motorcycles, this policy covers damages resulting from accidents, theft, and third-party liabilities, ensuring the freedom of the open road with peace of mind.','Active',30000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (114,'Classic Car Elegance','Vintage Cars','Geared towards vintage and classic cars, this policy offers extensive coverage for restoration costs, market value, and special roadside assistance, preserving the elegance of your cherished automobile.','Inactive',100000,60,'Auto');
INSERT INTO AutoPolicy_detail VALUES (115,'Electric Vehicle EcoShield','Electric Cars','Tailored for electric cars, this policy covers battery damage, charging equipment, and specialized repairs, promoting eco-friendly driving with dedicated insurance support.','Active',60000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (116,'Family safety plan','Sedan','This policy emphasizes safety, covering child seat replacements, medical expenses for passengers, and roadside assistance for families on the go.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (117,'Luxury Sedan Prestige Coverage','Sedan','Catering to luxury sedans, this policy offers specialized coverage for high-end interiors, technology systems, and concierge services, ensuring that every aspect of your luxury driving experience is protected','Active',100000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (118,'SafeDrive','Motorbike','Premium policy offering high coverage limits, including coverage for uninsured motorists and roadside assistance.','Active',100000,24,'Auto');
INSERT INTO AutoPolicy_detail VALUES (119,'Guardian Auto Insurance','Electric Cars','Short-term policy with comprehensive coverage, ideal for temporary needs such as rental cars or seasonal driving.','Inactive',60000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (120,'DriveSure Insuranc','SUV','Policy tailored for frequent travelers, offering coverage for rental cars and drivers in multiple states.','Active',80000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (121,'Liberty Auto Assurance','Sedan & SUV','Standard coverage for collisions and comprehensive damages, with optional add-ons for enhanced protection.','Active',50000,12,'Auto');
INSERT INTO AutoPolicy_detail VALUES (122,'ABC Plan','Sedan & SUV','Basic coverage for liability and medical expenses, suitable for low-risk drivers.','Inactive',40000,12,'Auto');

In [28]:
home = pd.read_csv('home.csv')

In [29]:
home.head()

,Policy_id,Name,Type,Description,Policy_active_flag,Sum_assured,Tenure_in_months,Policy_type
0,100,HomeShield,Rent and Owned,Comprehensive coverage for the structure of th...,Active,300000,12,Home
1,101,SecureHome,Owned,"Premium policy offering high coverage limits, ...",Active,500000,24,Home
2,102,SafeHaven Insurance,Rent and Owned,Basic coverage for the home's structure and es...,Active,250000,12,Home
3,103,Liberty Home Protection,Owned,"Standard policy covering damages from fire, va...",Inactive,400000,12,Home
4,104,EverGuard Home Insurance,Owned,Long-term coverage with benefits like extended...,Active,350000,36,Home

In [30]:
for Policy_id, Name, Type,Description,Policy_active_flag, Sum_assured, Tenure_in_months, Policy_type in home.values.tolist():
    print("INSERT INTO HomePolicy_detail VALUES ({},'{}','{}','{}','{}',{},{},'{}');".format(Policy_id, Name, Type,Description,Policy_active_flag, Sum_assured, Tenure_in_months, Policy_type))

INSERT INTO HomePolicy_detail VALUES (100,'HomeShield','Rent and Owned','Comprehensive coverage for the structure of the home, personal belongings, liability protection, and additional living expenses in case of temporary displacement due to covered events.','Active',300000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (101,'SecureHome','Owned','Premium policy offering high coverage limits, including protection against natural disasters, theft, and personal injury liability, with options for custom add-ons.','Active',500000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (102,'SafeHaven Insurance','Rent and Owned','Basic coverage for the home's structure and essential belongings, suitable for homeowners seeking affordable protection against common risks.','Active',250000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (103,'Liberty Home Protection','Owned','Standard policy covering damages from fire, vandalism, and certain natural disasters, along with liability coverage for accidents on the property.','Inactive',400000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (104,'EverGuard Home Insurance','Owned','Long-term coverage with benefits like extended replacement cost, which ensures the home can be rebuilt to its original condition even if construction costs rise.','Active',350000,36,'Home');
INSERT INTO HomePolicy_detail VALUES (105,'Guardian Home Assurance','Rent and Owned','Policy offering protection against various perils, including water damage, mold, and coverage for high-value items like jewelry and artwork.','Active',200000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (106,'National Home Protection','Rent','Short-term policy ideal for renters, offering coverage for personal belongings, liability, and temporary living expenses in case of covered events.','Active',100000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (107,'Reliable Home Insurance','Owned','Policy tailored for homeowners with additional structures on their property, such as detached garages or sheds, providing coverage for both the main home and other structures.','Active',100000,24,'Home');
INSERT INTO HomePolicy_detail VALUES (108,'SmartGuard Home Insurance','Owned','Customizable policy allowing homeowners to choose specific coverage limits and endorsements to protect unique assets and accommodate individual needs.','Inactive',350000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (109,'SafeHome Solutions','Owned','High-value policy with features like identity theft protection, credit card coverage, and coverage for unauthorized transactions due to cybercrime.','Active',555000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (110,'HomeAssure Services','Rent','Policy offering coverage for home systems and appliances, such as HVAC, electrical, and plumbing, providing financial protection against unexpected repair or replacement costs.','Active',400000,12,'Home');
INSERT INTO HomePolicy_detail VALUES (111,'One Home Insurance','Owned','Long-term policy with perks like extended coverage for valuables, home office equipment, and reimbursement for temporary housing and meals during repairs.','Inactive',250000,12,'Home');

In [69]:
import pandas as pd
import random
from datetime import datetime, timedelta

# Function to generate random dates within a given range
def random_dates(start_date, end_date, n=10):
    date_range = [start_date + timedelta(days=random.randint(0, (end_date - start_date).days)) for _ in range(n)]
    return date_range

# Sample data for Policy_Holder
customer_ids = [987673, 352841, 554593, 778711, 78932, 319355, 719439, 538409, 979749, 640537,
                871428, 847339, 94613, 628418, 974101, 930301, 915790, 389080, 336850, 176254,
                638484, 621200, 555849, 972654, 492977, 77471, 289060, 166248, 830875, 591642,
                293654, 532909, 109075, 174408, 632251, 981115, 58082, 499661, 950610, 358893,
                867938, 114971, 365390, 872585, 144402, 345273, 415216, 733572, 74341, 249650]

auto_policy_ids = list(range(111, 123))
home_policy_ids = list(range(100, 112))
agent_ids = [97444, 80340, 6768, 52121, 85926, 73812, 95189, 92085, 92900, 69259,
             13041, 78600, 33645, 47590, 54342, 74988, 39178, 30720, 4629, 96845,
             66218, 97840, 35917, 49539, 80633, 92786, 68833, 71268, 80048, 31957,
             88459, 58102, 125, 56777, 11119, 66624, 95587, 46129, 62599, 38302,
             62068, 76607, 2340, 85484, 27853, 16339, 24998, 47781, 39992, 31487]

# Create a DataFrame for Policy_Holder
home_policy_ids = random.choices(home_policy_ids + [0], k=50)
auto_policy_ids = random.choices(auto_policy_ids + [0], k=50)
# policy_ids = [auto_policy_ids[i] if auto_policy_ids[i] != 0 else home_policy_ids[i] for i in range(50)]

data = {
    'Holder_id': list(range(1, 51)),
    'Customer_id': random.choices(customer_ids, k=50),
    'Home_Policy_id': home_policy_ids,
    'Auto_Policy_id': auto_policy_ids,
    #'Policy_type': ['Auto' if auto_policy_ids[i] != 0 else 'Home' if home_policy_ids[i] != 0 else 'Both' if auto_policy_ids[i] != 0 and home_policy_ids[i] != 0 else None for i in range(50)],
    'status_of_policy': random.choices(['Active', 'Inactive'], k=50),
    'StartDate': random_dates(datetime(2022, 1, 1), datetime(2022, 6, 30), n=50),
    'ExpiryDate': random_dates(datetime(2022, 7, 1), datetime(2022, 12, 31), n=50),
    'RenewDate': random_dates(datetime(2023, 1, 1), datetime(2023, 6, 30), n=50),
    'at_risk_flag': random.choices(['Yes', 'No'], k=50),
    'Agent_id': random.choices(agent_ids, k=50)
}

policy_holder_df = pd.DataFrame(data)

# Display the DataFrame
print(policy_holder_df)

# Save the DataFrame to a CSV file
policy_holder_df.to_csv('policy_holder_data.csv', index=False)

    Holder_id  Customer_id  Home_Policy_id  Auto_Policy_id status_of_policy  \
0           1       176254               0             119           Active
1           2       628418             104             116         Inactive
2           3       538409             100             114           Active
3           4       638484             103             117           Active
4           5       554593             109             119         Inactive
5           6       640537             100             119           Active
6           7       176254             111             122         Inactive
7           8       114971             109             112           Active
8           9       930301             109               0           Active
9          10       981115             108             112         Inactive
10         11       499661             102             119         Inactive
11         12       293654             111             116         Inactive
12         13       499661             106             118           Active
13         14       389080             103             117         Inactive
14         15       415216             104             116           Active
15         16       293654             110             119           Active
16         17       319355             103             116           Active
17         18       847339             110             119         Inactive
18         19       365390             107               0         Inactive
19         20       555849             102               0         Inactive
20         21       638484             111             120           Active
21         22       114971             111             117           Active
22         23       981115             103             122         Inactive
23         24       176254             103               0         Inactive
24         25       930301             111             121         Inactive
25         26       249650             104             117           Active
26         27       974101             100             117         Inactive
27         28        74341             104             114         Inactive
28         29       979749             101             113           Active
29         30       365390             102             122           Active
30         31        94613             100               0         Inactive
31         32       979749               0             119           Active
32         33       345273             107             118         Inactive
33         34       979749             105             113           Active
34         35       972654             110             122           Active
35         36       621200             103             113         Inactive
36         37       632251             102             113           Active
37         38       492977             108             118           Active
38         39        77471             103             114         Inactive
39         40       628418             108             114         Inactive
40         41       640537             101             119           Active
41         42        58082             109             112           Active
42         43       352841             105             117         Inactive
43         44       974101             101               0         Inactive
44         45        94613             103               0           Active
45         46       176254             102             119           Active
46         47       591642             101             119         Inactive
47         48       830875               0             111           Active
48         49       628418             101             122         Inactive
49         50       319355             101             118           Active

    StartDate ExpiryDate  RenewDate at_risk_flag  Agent_id
0  2022-06-07 2022-08-16 2023-05-19           No     54342
1  2022-02-08 2022-10-27 2023-01-28           No     46129
2  2022-03-29 2022-09-22 2023-01-20          Yes     96845
3  2022-05-02 2022-10-07 2023-01-25          Yes     47781
4  2022-02-06 2022-08-15 2023-03-07          Yes      4629
5  2022-01-06 2022-11-19 2023-02-04          Yes     39992
6  2022-05-25 2022-07-19 2023-06-13          Yes     24998
7  2022-06-30 2022-08-29 2023-02-04          Yes     58102
8  2022-02-20 2022-08-19 2023-02-19          Yes     92900
9  2022-03-19 2022-12-10 2023-06-21           No     52121
10 2022-02-26 2022-09-13 2023-06-07           No     62599
11 2022-03-26 2022-08-15 2023-04-07          Yes     24998
12 2022-01-27 2022-11-19 2023-04-06           No     96845
13 2022-03-13 2022-12-01 2023-03-04           No     38302
14 2022-02-13 2022-08-16 2023-03-23          Yes     74988
15 2022-01-23 2022-12-12 2023-01-12          Yes     80340
16 2022-06-23 2022-11-16 2023-05-12          Yes     96845
17 2022-04-03 2022-08-02 2023-01-28          Yes       125
18 2022-05-26 2022-08-09 2023-01-17          Yes     56777
19 2022-02-02 2022-10-01 2023-01-22           No     33645
20 2022-04-27 2022-10-08 2023-04-21           No     47781
21 2022-02-28 2022-07-18 2023-05-22          Yes     88459
22 2022-03-03 2022-08-21 2023-05-03          Yes     88459
23 2022-02-19 2022-12-05 2023-01-02           No     66624
24 2022-04-07 2022-11-05 2023-03-16           No     62068
25 2022-05-17 2022-09-18 2023-04-12          Yes     27853
26 2022-05-26 2022-07-13 2023-05-16          Yes     92786
27 2022-03-21 2022-11-10 2023-02-05           No     52121
28 2022-05-08 2022-09-04 2023-01-05          Yes     31487
29 2022-02-24 2022-10-22 2023-04-16          Yes     95587
30 2022-06-16 2022-11-15 2023-03-25          Yes     33645
31 2022-02-01 2022-11-06 2023-01-15           No     31957
32 2022-06-21 2022-12-14 2023-05-15          Yes     47590
33 2022-04-13 2022-11-02 2023-01-08          Yes     66624
34 2022-02-23 2022-10-04 2023-04-11          Yes     11119
35 2022-05-21 2022-08-29 2023-01-29          Yes       125
36 2022-01-13 2022-10-13 2023-04-18          Yes     74988
37 2022-05-15 2022-08-04 2023-03-31           No     85484
38 2022-03-18 2022-12-16 2023-05-16           No     31487
39 2022-05-18 2022-10-11 2023-02-27          Yes     76607
40 2022-05-11 2022-11-19 2023-05-18          Yes     97444
41 2022-06-02 2022-11-26 2023-01-02          Yes     74988
42 2022-06-28 2022-12-22 2023-01-29           No     52121
43 2022-03-16 2022-10-10 2023-02-10           No     95587
44 2022-03-31 2022-12-08 2023-03-23           No     97840
45 2022-06-25 2022-10-30 2023-03-23           No     68833
46 2022-06-27 2022-07-19 2023-05-11          Yes     71268
47 2022-03-13 2022-11-12 2023-04-07           No     16339
48 2022-02-04 2022-07-02 2023-03-26          Yes     80340
49 2022-02-11 2022-09-12 2023-01-13           No     31957

In [71]:
#creating INSERT SQL file for Policy_holder table
for Holder_id, Customer_id, Home_Policy_id, Auto_Policy_id, status_of_policy, Start_Date, ExpiryDate, RenewDate, at_risk_flag, Agent_id in policy_holder_df.values.tolist():
    print("INSERT INTO Policy_Holder VALUES ({},{},{},{},'{}','{}','{}', '{}','{}',{});".format(Holder_id, Customer_id, Home_Policy_id, Auto_Policy_id, status_of_policy, Start_Date, ExpiryDate, RenewDate, at_risk_flag, Agent_id))

INSERT INTO Policy_Holder VALUES (1,176254,0,119,'Active','2022-06-07 00:00:00','2022-08-16 00:00:00', '2023-05-19 00:00:00','No',54342);
INSERT INTO Policy_Holder VALUES (2,628418,104,116,'Inactive','2022-02-08 00:00:00','2022-10-27 00:00:00', '2023-01-28 00:00:00','No',46129);
INSERT INTO Policy_Holder VALUES (3,538409,100,114,'Active','2022-03-29 00:00:00','2022-09-22 00:00:00', '2023-01-20 00:00:00','Yes',96845);
INSERT INTO Policy_Holder VALUES (4,638484,103,117,'Active','2022-05-02 00:00:00','2022-10-07 00:00:00', '2023-01-25 00:00:00','Yes',47781);
INSERT INTO Policy_Holder VALUES (5,554593,109,119,'Inactive','2022-02-06 00:00:00','2022-08-15 00:00:00', '2023-03-07 00:00:00','Yes',4629);
INSERT INTO Policy_Holder VALUES (6,640537,100,119,'Active','2022-01-06 00:00:00','2022-11-19 00:00:00', '2023-02-04 00:00:00','Yes',39992);
INSERT INTO Policy_Holder VALUES (7,176254,111,122,'Inactive','2022-05-25 00:00:00','2022-07-19 00:00:00', '2023-06-13 00:00:00','Yes',24998);
INSERT INTO Policy_Holder VALUES (8,114971,109,112,'Active','2022-06-30 00:00:00','2022-08-29 00:00:00', '2023-02-04 00:00:00','Yes',58102);
INSERT INTO Policy_Holder VALUES (9,930301,109,0,'Active','2022-02-20 00:00:00','2022-08-19 00:00:00', '2023-02-19 00:00:00','Yes',92900);
INSERT INTO Policy_Holder VALUES (10,981115,108,112,'Inactive','2022-03-19 00:00:00','2022-12-10 00:00:00', '2023-06-21 00:00:00','No',52121);
INSERT INTO Policy_Holder VALUES (11,499661,102,119,'Inactive','2022-02-26 00:00:00','2022-09-13 00:00:00', '2023-06-07 00:00:00','No',62599);
INSERT INTO Policy_Holder VALUES (12,293654,111,116,'Inactive','2022-03-26 00:00:00','2022-08-15 00:00:00', '2023-04-07 00:00:00','Yes',24998);
INSERT INTO Policy_Holder VALUES (13,499661,106,118,'Active','2022-01-27 00:00:00','2022-11-19 00:00:00', '2023-04-06 00:00:00','No',96845);
INSERT INTO Policy_Holder VALUES (14,389080,103,117,'Inactive','2022-03-13 00:00:00','2022-12-01 00:00:00', '2023-03-04 00:00:00','No',38302);
INSERT INTO Policy_Holder VALUES (15,415216,104,116,'Active','2022-02-13 00:00:00','2022-08-16 00:00:00', '2023-03-23 00:00:00','Yes',74988);
INSERT INTO Policy_Holder VALUES (16,293654,110,119,'Active','2022-01-23 00:00:00','2022-12-12 00:00:00', '2023-01-12 00:00:00','Yes',80340);
INSERT INTO Policy_Holder VALUES (17,319355,103,116,'Active','2022-06-23 00:00:00','2022-11-16 00:00:00', '2023-05-12 00:00:00','Yes',96845);
INSERT INTO Policy_Holder VALUES (18,847339,110,119,'Inactive','2022-04-03 00:00:00','2022-08-02 00:00:00', '2023-01-28 00:00:00','Yes',125);
INSERT INTO Policy_Holder VALUES (19,365390,107,0,'Inactive','2022-05-26 00:00:00','2022-08-09 00:00:00', '2023-01-17 00:00:00','Yes',56777);
INSERT INTO Policy_Holder VALUES (20,555849,102,0,'Inactive','2022-02-02 00:00:00','2022-10-01 00:00:00', '2023-01-22 00:00:00','No',33645);
INSERT INTO Policy_Holder VALUES (21,638484,111,120,'Active','2022-04-27 00:00:00','2022-10-08 00:00:00', '2023-04-21 00:00:00','No',47781);
INSERT INTO Policy_Holder VALUES (22,114971,111,117,'Active','2022-02-28 00:00:00','2022-07-18 00:00:00', '2023-05-22 00:00:00','Yes',88459);
INSERT INTO Policy_Holder VALUES (23,981115,103,122,'Inactive','2022-03-03 00:00:00','2022-08-21 00:00:00', '2023-05-03 00:00:00','Yes',88459);
INSERT INTO Policy_Holder VALUES (24,176254,103,0,'Inactive','2022-02-19 00:00:00','2022-12-05 00:00:00', '2023-01-02 00:00:00','No',66624);
INSERT INTO Policy_Holder VALUES (25,930301,111,121,'Inactive','2022-04-07 00:00:00','2022-11-05 00:00:00', '2023-03-16 00:00:00','No',62068);
INSERT INTO Policy_Holder VALUES (26,249650,104,117,'Active','2022-05-17 00:00:00','2022-09-18 00:00:00', '2023-04-12 00:00:00','Yes',27853);
INSERT INTO Policy_Holder VALUES (27,974101,100,117,'Inactive','2022-05-26 00:00:00','2022-07-13 00:00:00', '2023-05-16 00:00:00','Yes',92786);
INSERT INTO Policy_Holder VALUES (28,74341,104,114,'Inactive','2022-03-21 00:00:00','2022-11-10 00:00:00', '2023-02-05 00:00:00','No',52121);
INSERT INTO Policy_Holder VALUES (29,979749,101,113,'Active','2022-05-08 00:00:00','2022-09-04 00:00:00', '2023-01-05 00:00:00','Yes',31487);
INSERT INTO Policy_Holder VALUES (30,365390,102,122,'Active','2022-02-24 00:00:00','2022-10-22 00:00:00', '2023-04-16 00:00:00','Yes',95587);
INSERT INTO Policy_Holder VALUES (31,94613,100,0,'Inactive','2022-06-16 00:00:00','2022-11-15 00:00:00', '2023-03-25 00:00:00','Yes',33645);
INSERT INTO Policy_Holder VALUES (32,979749,0,119,'Active','2022-02-01 00:00:00','2022-11-06 00:00:00', '2023-01-15 00:00:00','No',31957);
INSERT INTO Policy_Holder VALUES (33,345273,107,118,'Inactive','2022-06-21 00:00:00','2022-12-14 00:00:00', '2023-05-15 00:00:00','Yes',47590);
INSERT INTO Policy_Holder VALUES (34,979749,105,113,'Active','2022-04-13 00:00:00','2022-11-02 00:00:00', '2023-01-08 00:00:00','Yes',66624);
INSERT INTO Policy_Holder VALUES (35,972654,110,122,'Active','2022-02-23 00:00:00','2022-10-04 00:00:00', '2023-04-11 00:00:00','Yes',11119);
INSERT INTO Policy_Holder VALUES (36,621200,103,113,'Inactive','2022-05-21 00:00:00','2022-08-29 00:00:00', '2023-01-29 00:00:00','Yes',125);
INSERT INTO Policy_Holder VALUES (37,632251,102,113,'Active','2022-01-13 00:00:00','2022-10-13 00:00:00', '2023-04-18 00:00:00','Yes',74988);
INSERT INTO Policy_Holder VALUES (38,492977,108,118,'Active','2022-05-15 00:00:00','2022-08-04 00:00:00', '2023-03-31 00:00:00','No',85484);
INSERT INTO Policy_Holder VALUES (39,77471,103,114,'Inactive','2022-03-18 00:00:00','2022-12-16 00:00:00', '2023-05-16 00:00:00','No',31487);
INSERT INTO Policy_Holder VALUES (40,628418,108,114,'Inactive','2022-05-18 00:00:00','2022-10-11 00:00:00', '2023-02-27 00:00:00','Yes',76607);
INSERT INTO Policy_Holder VALUES (41,640537,101,119,'Active','2022-05-11 00:00:00','2022-11-19 00:00:00', '2023-05-18 00:00:00','Yes',97444);
INSERT INTO Policy_Holder VALUES (42,58082,109,112,'Active','2022-06-02 00:00:00','2022-11-26 00:00:00', '2023-01-02 00:00:00','Yes',74988);
INSERT INTO Policy_Holder VALUES (43,352841,105,117,'Inactive','2022-06-28 00:00:00','2022-12-22 00:00:00', '2023-01-29 00:00:00','No',52121);
INSERT INTO Policy_Holder VALUES (44,974101,101,0,'Inactive','2022-03-16 00:00:00','2022-10-10 00:00:00', '2023-02-10 00:00:00','No',95587);
INSERT INTO Policy_Holder VALUES (45,94613,103,0,'Active','2022-03-31 00:00:00','2022-12-08 00:00:00', '2023-03-23 00:00:00','No',97840);
INSERT INTO Policy_Holder VALUES (46,176254,102,119,'Active','2022-06-25 00:00:00','2022-10-30 00:00:00', '2023-03-23 00:00:00','No',68833);
INSERT INTO Policy_Holder VALUES (47,591642,101,119,'Inactive','2022-06-27 00:00:00','2022-07-19 00:00:00', '2023-05-11 00:00:00','Yes',71268);
INSERT INTO Policy_Holder VALUES (48,830875,0,111,'Active','2022-03-13 00:00:00','2022-11-12 00:00:00', '2023-04-07 00:00:00','No',16339);
INSERT INTO Policy_Holder VALUES (49,628418,101,122,'Inactive','2022-02-04 00:00:00','2022-07-02 00:00:00', '2023-03-26 00:00:00','Yes',80340);
INSERT INTO Policy_Holder VALUES (50,319355,101,118,'Active','2022-02-11 00:00:00','2022-09-12 00:00:00', '2023-01-13 00:00:00','No',31957);

In [75]:
pip install faker

Collecting faker
  Downloading Faker-20.0.0-py3-none-any.whl (1.7 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.7/1.7 MB 16.0 MB/s eta 0:00:00a 0:00:01
Requirement already satisfied: python-dateutil>=2.4 in /Users/karanbadlani/anaconda3/lib/python3.11/site-packages (from faker) (2.8.2)
Requirement already satisfied: six>=1.5 in /Users/karanbadlani/anaconda3/lib/python3.11/site-packages (from python-dateutil>=2.4->faker) (1.16.0)
Installing collected packages: faker
Successfully installed faker-20.0.0
Note: you may need to restart the kernel to use updated packages.

In [76]:
import pandas as pd
from faker import Faker
import random
from datetime import datetime, timedelta

# Initialize Faker
fake = Faker()

# Generate data for Report_Details
data = {
    'Report_id': list(range(1, 31)),
    'Date': [fake.date_between(start_date='-365d', end_date='today') for _ in range(30)],
    'Damage_amount': [random.randint(100, 10000) for _ in range(30)]
}

# Create a DataFrame
report_details_df = pd.DataFrame(data)

# Display the DataFrame
print(report_details_df)

# Save the DataFrame to a CSV file
report_details_df.to_csv('report_details_data.csv', index=False)

    Report_id        Date  Damage_amount
0           1  2023-04-11           4900
1           2  2023-10-12           4034
2           3  2023-07-30           4697
3           4  2023-06-03           3866
4           5  2022-11-12           8843
5           6  2023-03-30           5203
6           7  2023-06-20           3597
7           8  2023-09-06           7932
8           9  2023-03-07           9240
9          10  2023-03-12           8678
10         11  2023-04-02           2970
11         12  2023-08-18           5651
12         13  2023-01-10           2433
13         14  2023-02-01           7481
14         15  2023-10-13           9606
15         16  2023-01-02           4016
16         17  2023-03-25           3825
17         18  2022-12-15           5752
18         19  2023-05-10           1536
19         20  2023-09-18           2185
20         21  2023-08-19           4878
21         22  2023-09-09           7132
22         23  2023-09-29           7753
23         24  2023-06-07           9326
24         25  2022-12-26           5812
25         26  2023-01-18           7734
26         27  2023-08-04           6483
27         28  2023-08-26           3024
28         29  2023-06-27           2968
29         30  2023-03-08           8971

In [77]:
#creating INSERT SQL file for Report_Details table
for Report_id, Date, Damage_amount  in report_details_df.values.tolist():
    print("INSERT INTO Report_Details VALUES ({},'{}',{});".format(Report_id, Date, Damage_amount))

INSERT INTO Report_Details VALUES (1,'2023-04-11',4900);
INSERT INTO Report_Details VALUES (2,'2023-10-12',4034);
INSERT INTO Report_Details VALUES (3,'2023-07-30',4697);
INSERT INTO Report_Details VALUES (4,'2023-06-03',3866);
INSERT INTO Report_Details VALUES (5,'2022-11-12',8843);
INSERT INTO Report_Details VALUES (6,'2023-03-30',5203);
INSERT INTO Report_Details VALUES (7,'2023-06-20',3597);
INSERT INTO Report_Details VALUES (8,'2023-09-06',7932);
INSERT INTO Report_Details VALUES (9,'2023-03-07',9240);
INSERT INTO Report_Details VALUES (10,'2023-03-12',8678);
INSERT INTO Report_Details VALUES (11,'2023-04-02',2970);
INSERT INTO Report_Details VALUES (12,'2023-08-18',5651);
INSERT INTO Report_Details VALUES (13,'2023-01-10',2433);
INSERT INTO Report_Details VALUES (14,'2023-02-01',7481);
INSERT INTO Report_Details VALUES (15,'2023-10-13',9606);
INSERT INTO Report_Details VALUES (16,'2023-01-02',4016);
INSERT INTO Report_Details VALUES (17,'2023-03-25',3825);
INSERT INTO Report_Details VALUES (18,'2022-12-15',5752);
INSERT INTO Report_Details VALUES (19,'2023-05-10',1536);
INSERT INTO Report_Details VALUES (20,'2023-09-18',2185);
INSERT INTO Report_Details VALUES (21,'2023-08-19',4878);
INSERT INTO Report_Details VALUES (22,'2023-09-09',7132);
INSERT INTO Report_Details VALUES (23,'2023-09-29',7753);
INSERT INTO Report_Details VALUES (24,'2023-06-07',9326);
INSERT INTO Report_Details VALUES (25,'2022-12-26',5812);
INSERT INTO Report_Details VALUES (26,'2023-01-18',7734);
INSERT INTO Report_Details VALUES (27,'2023-08-04',6483);
INSERT INTO Report_Details VALUES (28,'2023-08-26',3024);
INSERT INTO Report_Details VALUES (29,'2023-06-27',2968);
INSERT INTO Report_Details VALUES (30,'2023-03-08',8971);

In [19]:
import random
import pandas as pd

# Sample data
holder_ids = list(range(1, 51))
loan_ids = ['LP001015', 'LP001022', 'LP001031', 'LP001035', 'LP001051', 'LP001054', 'LP001055', 'LP001056', 'LP001059',
            'LP001067', 'LP001078', 'LP001082', 'LP001083', 'LP001094', 'LP001096', 'LP001099', 'LP001105', 'LP001107',
            'LP001108', 'LP001115', 'LP001121', 'LP001124', 'LP001128', 'LP001135', 'LP001149', 'LP001153', 'LP001163',
            'LP001169', 'LP001174', 'LP001176', 'LP001177', 'LP001183', 'LP001185', 'LP001187', 'LP001190', 'LP001203',
            'LP001208', 'LP001210', 'LP001211', 'LP001219', 'LP001220', 'LP001221', 'LP001226', 'LP001230', 'LP001231',
            'LP001232', 'LP001237', 'LP001242', 'LP001268', 'LP001270', 'LP001284', 'LP001287', 'LP001291', 'LP001298',
            'LP001312']
manufacturers = ['Honda', 'BMW', 'Audi', 'Mercedes', 'Mazda', 'Lamborghini', 'Mustang', 'Kia', 'Maruti', 'Lincoln', 'Ford']
damage_levels = ['No damage', 'Some damage', 'High damage']
owner_types = [1, 2, 3]
age_categories = [1, 2, 3, 4, 5]

# Generating data for the table
data = []
for asset_id in range(1, 101):  # Assuming 100 records
    name = f'Vehicle_{asset_id}'
    manufacturer = random.choice(manufacturers)
    age = random.choice(age_categories)
    damage = random.choice(damage_levels)
    owner_number = random.choice(owner_types)
    holder_id = random.choice(holder_ids)
    loan_id = random.choice(loan_ids)

    # Derive Model_type logic from vehicle_type
    if random.choice([True, False]):
        model_type = 'Two Wheeler'
    else:
        model_type = 'Four Wheeler'

    data.append((asset_id, model_type, name, manufacturer, age, damage, owner_number, holder_id, loan_id))

# Create a DataFrame
columns = ['Asset_id', 'Model_type', 'Name', 'Manufacturer', 'Age', 'Damage', 'Owner_number', 'Holder_id', 'LoanId']
df = pd.DataFrame(data, columns=columns)

# Save to CSV file
df.to_csv('vehicle_details.csv', index=False)

print("Data saved to 'vehicle_details.csv'")

Data saved to 'vehicle_details.csv'

In [20]:
#creating INSERT SQL file for Vehicle_Details table
for Asset_id, Model_type, Name, Manufacturer, Age, Damage, Owner_number, Holder_id, LoanId  in df.values.tolist():
    print("INSERT INTO Vehicle_Details VALUES ({},'{}','{}','{}',{},'{}',{},{},'{}');".format(Asset_id, Model_type, Name, Manufacturer, Age, Damage, Owner_number, Holder_id, LoanId))

INSERT INTO Vehicle_Details VALUES (1,'Four Wheeler','Vehicle_1','Mustang',3,'High damage',3,25,'LP001055');
INSERT INTO Vehicle_Details VALUES (2,'Four Wheeler','Vehicle_2','Honda',1,'No damage',1,1,'LP001174');
INSERT INTO Vehicle_Details VALUES (3,'Two Wheeler','Vehicle_3','Honda',4,'Some damage',2,1,'LP001169');
INSERT INTO Vehicle_Details VALUES (4,'Four Wheeler','Vehicle_4','Mazda',1,'Some damage',2,7,'LP001121');
INSERT INTO Vehicle_Details VALUES (5,'Two Wheeler','Vehicle_5','Lincoln',2,'Some damage',3,12,'LP001067');
INSERT INTO Vehicle_Details VALUES (6,'Two Wheeler','Vehicle_6','Mustang',1,'High damage',2,49,'LP001107');
INSERT INTO Vehicle_Details VALUES (7,'Four Wheeler','Vehicle_7','Mustang',4,'No damage',1,39,'LP001105');
INSERT INTO Vehicle_Details VALUES (8,'Two Wheeler','Vehicle_8','Mustang',5,'Some damage',2,39,'LP001230');
INSERT INTO Vehicle_Details VALUES (9,'Two Wheeler','Vehicle_9','Lincoln',1,'High damage',3,15,'LP001022');
INSERT INTO Vehicle_Details VALUES (10,'Two Wheeler','Vehicle_10','Audi',1,'High damage',2,46,'LP001174');
INSERT INTO Vehicle_Details VALUES (11,'Two Wheeler','Vehicle_11','Mustang',3,'Some damage',2,3,'LP001094');
INSERT INTO Vehicle_Details VALUES (12,'Four Wheeler','Vehicle_12','BMW',5,'High damage',2,37,'LP001015');
INSERT INTO Vehicle_Details VALUES (13,'Four Wheeler','Vehicle_13','Audi',5,'High damage',2,37,'LP001153');
INSERT INTO Vehicle_Details VALUES (14,'Four Wheeler','Vehicle_14','Ford',5,'High damage',3,8,'LP001059');
INSERT INTO Vehicle_Details VALUES (15,'Two Wheeler','Vehicle_15','Audi',2,'High damage',1,5,'LP001231');
INSERT INTO Vehicle_Details VALUES (16,'Four Wheeler','Vehicle_16','Honda',3,'High damage',1,47,'LP001135');
INSERT INTO Vehicle_Details VALUES (17,'Four Wheeler','Vehicle_17','BMW',2,'No damage',3,28,'LP001051');
INSERT INTO Vehicle_Details VALUES (18,'Four Wheeler','Vehicle_18','Mercedes',1,'No damage',3,22,'LP001031');
INSERT INTO Vehicle_Details VALUES (19,'Two Wheeler','Vehicle_19','Ford',4,'High damage',3,32,'LP001169');
INSERT INTO Vehicle_Details VALUES (20,'Four Wheeler','Vehicle_20','BMW',1,'No damage',2,2,'LP001291');
INSERT INTO Vehicle_Details VALUES (21,'Four Wheeler','Vehicle_21','Lincoln',3,'No damage',1,29,'LP001108');
INSERT INTO Vehicle_Details VALUES (22,'Two Wheeler','Vehicle_22','Mustang',4,'High damage',3,26,'LP001210');
INSERT INTO Vehicle_Details VALUES (23,'Two Wheeler','Vehicle_23','Kia',2,'No damage',2,24,'LP001230');
INSERT INTO Vehicle_Details VALUES (24,'Two Wheeler','Vehicle_24','BMW',4,'High damage',3,1,'LP001055');
INSERT INTO Vehicle_Details VALUES (25,'Four Wheeler','Vehicle_25','Mazda',2,'Some damage',3,36,'LP001067');
INSERT INTO Vehicle_Details VALUES (26,'Two Wheeler','Vehicle_26','Honda',1,'High damage',3,47,'LP001059');
INSERT INTO Vehicle_Details VALUES (27,'Two Wheeler','Vehicle_27','Ford',5,'High damage',2,30,'LP001291');
INSERT INTO Vehicle_Details VALUES (28,'Four Wheeler','Vehicle_28','Audi',4,'No damage',2,32,'LP001312');
INSERT INTO Vehicle_Details VALUES (29,'Four Wheeler','Vehicle_29','Ford',4,'Some damage',2,10,'LP001284');
INSERT INTO Vehicle_Details VALUES (30,'Two Wheeler','Vehicle_30','Honda',4,'No damage',2,33,'LP001096');
INSERT INTO Vehicle_Details VALUES (31,'Two Wheeler','Vehicle_31','Mazda',3,'Some damage',2,48,'LP001022');
INSERT INTO Vehicle_Details VALUES (32,'Four Wheeler','Vehicle_32','Lamborghini',4,'Some damage',2,30,'LP001149');
INSERT INTO Vehicle_Details VALUES (33,'Four Wheeler','Vehicle_33','Lamborghini',1,'High damage',1,2,'LP001174');
INSERT INTO Vehicle_Details VALUES (34,'Four Wheeler','Vehicle_34','Lamborghini',5,'No damage',1,15,'LP001221');
INSERT INTO Vehicle_Details VALUES (35,'Two Wheeler','Vehicle_35','Maruti',3,'No damage',2,14,'LP001153');
INSERT INTO Vehicle_Details VALUES (36,'Two Wheeler','Vehicle_36','Mustang',3,'No damage',1,27,'LP001124');
INSERT INTO Vehicle_Details VALUES (37,'Two Wheeler','Vehicle_37','Mercedes',5,'Some damage',3,14,'LP001022');
INSERT INTO Vehicle_Details VALUES (38,'Four Wheeler','Vehicle_38','Mercedes',2,'No damage',1,2,'LP001022');
INSERT INTO Vehicle_Details VALUES (39,'Four Wheeler','Vehicle_39','Mercedes',1,'Some damage',3,11,'LP001099');
INSERT INTO Vehicle_Details VALUES (40,'Four Wheeler','Vehicle_40','Mustang',3,'High damage',1,15,'LP001107');
INSERT INTO Vehicle_Details VALUES (41,'Four Wheeler','Vehicle_41','BMW',4,'No damage',2,39,'LP001210');
INSERT INTO Vehicle_Details VALUES (42,'Two Wheeler','Vehicle_42','Ford',3,'Some damage',1,35,'LP001105');
INSERT INTO Vehicle_Details VALUES (43,'Four Wheeler','Vehicle_43','Mercedes',1,'Some damage',2,5,'LP001055');
INSERT INTO Vehicle_Details VALUES (44,'Two Wheeler','Vehicle_44','Mercedes',1,'No damage',1,25,'LP001107');
INSERT INTO Vehicle_Details VALUES (45,'Four Wheeler','Vehicle_45','Honda',3,'No damage',3,25,'LP001078');
INSERT INTO Vehicle_Details VALUES (46,'Two Wheeler','Vehicle_46','Lamborghini',1,'High damage',3,25,'LP001208');
INSERT INTO Vehicle_Details VALUES (47,'Four Wheeler','Vehicle_47','Mustang',1,'High damage',3,11,'LP001083');
INSERT INTO Vehicle_Details VALUES (48,'Four Wheeler','Vehicle_48','Honda',5,'High damage',2,13,'LP001096');
INSERT INTO Vehicle_Details VALUES (49,'Two Wheeler','Vehicle_49','Kia',1,'No damage',3,17,'LP001231');
INSERT INTO Vehicle_Details VALUES (50,'Four Wheeler','Vehicle_50','Mercedes',1,'No damage',1,23,'LP001219');
INSERT INTO Vehicle_Details VALUES (51,'Two Wheeler','Vehicle_51','Mazda',5,'High damage',3,39,'LP001055');
INSERT INTO Vehicle_Details VALUES (52,'Four Wheeler','Vehicle_52','Mazda',1,'High damage',1,45,'LP001268');
INSERT INTO Vehicle_Details VALUES (53,'Four Wheeler','Vehicle_53','Lincoln',1,'Some damage',2,6,'LP001059');
INSERT INTO Vehicle_Details VALUES (54,'Two Wheeler','Vehicle_54','Ford',1,'No damage',2,40,'LP001190');
INSERT INTO Vehicle_Details VALUES (55,'Two Wheeler','Vehicle_55','Mazda',1,'High damage',1,9,'LP001232');
INSERT INTO Vehicle_Details VALUES (56,'Four Wheeler','Vehicle_56','Ford',2,'High damage',1,37,'LP001022');
INSERT INTO Vehicle_Details VALUES (57,'Two Wheeler','Vehicle_57','Ford',2,'No damage',2,29,'LP001230');
INSERT INTO Vehicle_Details VALUES (58,'Two Wheeler','Vehicle_58','BMW',5,'High damage',3,6,'LP001083');
INSERT INTO Vehicle_Details VALUES (59,'Four Wheeler','Vehicle_59','Ford',4,'No damage',3,28,'LP001099');
INSERT INTO Vehicle_Details VALUES (60,'Two Wheeler','Vehicle_60','Honda',1,'Some damage',3,33,'LP001242');
INSERT INTO Vehicle_Details VALUES (61,'Four Wheeler','Vehicle_61','Honda',1,'Some damage',2,34,'LP001115');
INSERT INTO Vehicle_Details VALUES (62,'Two Wheeler','Vehicle_62','Lamborghini',2,'High damage',3,20,'LP001056');
INSERT INTO Vehicle_Details VALUES (63,'Four Wheeler','Vehicle_63','BMW',5,'Some damage',2,42,'LP001108');
INSERT INTO Vehicle_Details VALUES (64,'Four Wheeler','Vehicle_64','Lamborghini',5,'No damage',3,47,'LP001149');
INSERT INTO Vehicle_Details VALUES (65,'Two Wheeler','Vehicle_65','Lincoln',5,'High damage',2,37,'LP001187');
INSERT INTO Vehicle_Details VALUES (66,'Four Wheeler','Vehicle_66','Honda',2,'Some damage',1,9,'LP001096');
INSERT INTO Vehicle_Details VALUES (67,'Four Wheeler','Vehicle_67','Mercedes',3,'Some damage',1,7,'LP001232');
INSERT INTO Vehicle_Details VALUES (68,'Four Wheeler','Vehicle_68','Mercedes',4,'High damage',2,24,'LP001124');
INSERT INTO Vehicle_Details VALUES (69,'Two Wheeler','Vehicle_69','Maruti',1,'No damage',3,45,'LP001149');
INSERT INTO Vehicle_Details VALUES (70,'Two Wheeler','Vehicle_70','Mustang',4,'High damage',3,7,'LP001015');
INSERT INTO Vehicle_Details VALUES (71,'Two Wheeler','Vehicle_71','Maruti',2,'High damage',1,2,'LP001169');
INSERT INTO Vehicle_Details VALUES (72,'Four Wheeler','Vehicle_72','Mustang',2,'High damage',3,3,'LP001210');
INSERT INTO Vehicle_Details VALUES (73,'Four Wheeler','Vehicle_73','Ford',3,'High damage',3,14,'LP001230');
INSERT INTO Vehicle_Details VALUES (74,'Two Wheeler','Vehicle_74','Ford',2,'No damage',3,26,'LP001108');
INSERT INTO Vehicle_Details VALUES (75,'Two Wheeler','Vehicle_75','Mustang',4,'Some damage',3,7,'LP001059');
INSERT INTO Vehicle_Details VALUES (76,'Four Wheeler','Vehicle_76','Audi',3,'Some damage',2,25,'LP001203');
INSERT INTO Vehicle_Details VALUES (77,'Four Wheeler','Vehicle_77','Honda',4,'High damage',2,39,'LP001183');
INSERT INTO Vehicle_Details VALUES (78,'Two Wheeler','Vehicle_78','BMW',4,'High damage',2,14,'LP001221');
INSERT INTO Vehicle_Details VALUES (79,'Four Wheeler','Vehicle_79','Kia',4,'No damage',2,46,'LP001149');
INSERT INTO Vehicle_Details VALUES (80,'Two Wheeler','Vehicle_80','Maruti',2,'High damage',3,7,'LP001176');
INSERT INTO Vehicle_Details VALUES (81,'Two Wheeler','Vehicle_81','Honda',3,'No damage',1,47,'LP001187');
INSERT INTO Vehicle_Details VALUES (82,'Four Wheeler','Vehicle_82','Honda',1,'Some damage',2,44,'LP001128');
INSERT INTO Vehicle_Details VALUES (83,'Four Wheeler','Vehicle_83','BMW',4,'Some damage',2,44,'LP001284');
INSERT INTO Vehicle_Details VALUES (84,'Two Wheeler','Vehicle_84','Honda',5,'Some damage',2,21,'LP001078');
INSERT INTO Vehicle_Details VALUES (85,'Four Wheeler','Vehicle_85','Maruti',2,'High damage',2,38,'LP001163');
INSERT INTO Vehicle_Details VALUES (86,'Two Wheeler','Vehicle_86','Ford',2,'Some damage',2,33,'LP001169');
INSERT INTO Vehicle_Details VALUES (87,'Two Wheeler','Vehicle_87','Audi',2,'High damage',1,34,'LP001298');
INSERT INTO Vehicle_Details VALUES (88,'Four Wheeler','Vehicle_88','Mazda',2,'No damage',2,36,'LP001226');
INSERT INTO Vehicle_Details VALUES (89,'Two Wheeler','Vehicle_89','Lincoln',2,'No damage',3,32,'LP001056');
INSERT INTO Vehicle_Details VALUES (90,'Four Wheeler','Vehicle_90','Kia',1,'High damage',3,49,'LP001059');
INSERT INTO Vehicle_Details VALUES (91,'Two Wheeler','Vehicle_91','Kia',1,'No damage',2,24,'LP001107');
INSERT INTO Vehicle_Details VALUES (92,'Two Wheeler','Vehicle_92','Lamborghini',4,'Some damage',3,47,'LP001208');
INSERT INTO Vehicle_Details VALUES (93,'Two Wheeler','Vehicle_93','BMW',4,'Some damage',2,10,'LP001190');
INSERT INTO Vehicle_Details VALUES (94,'Four Wheeler','Vehicle_94','Kia',1,'High damage',2,36,'LP001083');
INSERT INTO Vehicle_Details VALUES (95,'Four Wheeler','Vehicle_95','Audi',4,'High damage',2,5,'LP001128');
INSERT INTO Vehicle_Details VALUES (96,'Two Wheeler','Vehicle_96','Lamborghini',5,'Some damage',3,50,'LP001121');
INSERT INTO Vehicle_Details VALUES (97,'Four Wheeler','Vehicle_97','Kia',3,'High damage',1,9,'LP001185');
INSERT INTO Vehicle_Details VALUES (98,'Four Wheeler','Vehicle_98','Mercedes',5,'No damage',3,50,'LP001190');
INSERT INTO Vehicle_Details VALUES (99,'Two Wheeler','Vehicle_99','Honda',2,'Some damage',2,38,'LP001268');
INSERT INTO Vehicle_Details VALUES (100,'Four Wheeler','Vehicle_100','Lamborghini',3,'No damage',1,4,'LP001022');

In [28]:
# Working on Home_Details
# I'll be using a file that i got from kaggle and also generating some random data for missing columns
# reference - https://www.kaggle.com/datasets/emrahaydemr/home-sales-data-details-in-istanbul



import pandas as pd
import numpy as np
import random
import faker

holder_ids = list(range(1, 51))
loan_ids = ['LP001015', 'LP001022', 'LP001031', 'LP001035', 'LP001051', 'LP001054', 'LP001055', 'LP001056', 'LP001059',
            'LP001067', 'LP001078', 'LP001082', 'LP001083', 'LP001094', 'LP001096', 'LP001099', 'LP001105', 'LP001107',
            'LP001108', 'LP001115', 'LP001121', 'LP001124', 'LP001128', 'LP001135', 'LP001149', 'LP001153', 'LP001163',
            'LP001169', 'LP001174', 'LP001176', 'LP001177', 'LP001183', 'LP001185', 'LP001187', 'LP001190', 'LP001203',
            'LP001208', 'LP001210', 'LP001211', 'LP001219', 'LP001220', 'LP001221', 'LP001226', 'LP001230', 'LP001231',
            'LP001232', 'LP001237', 'LP001242', 'LP001268', 'LP001270', 'LP001284', 'LP001287', 'LP001291', 'LP001298',
            'LP001312']

# Initialize the Faker generator for USA addresses
fake = faker.Faker('en_US')

# Assuming 'your_data.csv' is the file containing your data
df = pd.read_csv('Home Sale Data.csv', delimiter=';')

# Create a new DataFrame with the desired columns and only 50 rows
new_df = pd.DataFrame(columns=['Asset_id', 'Address', 'Carpet_area', 'Construction_type', 'Estimated_market_value',
                               'Year_built', 'Holder_id', 'LoanId'])

# Set the primary key (Asset_id) as integers starting from 1
new_df['Asset_id'] = np.arange(1, 51)

# Use the columns that are similar to the attributes in the table
new_df['Carpet_area'] = df['m² (Net)'].head(50)  # Assuming 'm² (Net)' is the carpet area column
new_df['Estimated_market_value'] = np.random.randint(50000, 500000, 50)  # Random market values

# Use the provided 'year' list for the 'Year_built' column
new_df['Year_built'] = random.choices([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20], k=50)

# Set Construction_type as 'Old' if Year_built > 10, else 'New'
new_df['Construction_type'] = np.where(new_df['Year_built'] > 10, 'Old', 'New')

# Generate random Holder_id and LoanId based on the provided lists
new_df['Holder_id'] = random.choices(holder_ids, k=50)
new_df['LoanId'] = random.choices(loan_ids, k=50)

# Generate random USA addresses
new_df['Address'] = [fake.address() for _ in range(50)]


print(new_df)
new_df.to_csv('Home_Details.csv', index=False)

    Asset_id                                            Address  Carpet_area  \
0          1     369 Nicole Courts Apt. 390\nSotofurt, MP 46969         40.0
1          2  88846 Michael Rapid Apt. 509\nNew Ryanfurt, NY...         42.0
2          3           58138 Paul Trail\nPort Kristen, PA 22627         45.0
3          4    125 Wyatt Fords Suite 874\nLake Emily, NM 03235         46.0
4          5  63759 Graham Wells Suite 913\nMillerchester, M...         55.0
5          6  96275 Brian Lakes Apt. 664\nMelissamouth, VT 0...         55.0
6          7                   PSC 7700, Box 1021\nAPO AE 97757         60.0
7          8   0033 Chan Hills Apt. 643\nNew Rogerton, CO 94460         62.0
8          9  2657 Rebecca Locks Suite 354\nGarrettton, MP 8...         64.0
9         10            650 West Orchard\nCynthiafurt, UT 50554         65.0
10        11   821 Jill Light Suite 863\nCarrilloside, KS 06662         65.0
11        12        521 Robin Motorway\nChristineberg, AS 64097         65.0
12        13  20126 Kathryn Mission Suite 582\nNew Jaredches...         65.0
13        14         0622 Jones Greens\nAndreachester, WV 71705         65.0
14        15  832 Daniel Motorway Suite 328\nAmandaton, NY 7...         65.0
15        16                   Unit 1246 Box 9663\nDPO AE 12049         65.0
16        17   32531 Mclean Street\nEast Williammouth, UT 28268         67.0
17        18  23637 Monica Streets Suite 959\nSouth Randall,...         68.0
18        19           3901 Adam Branch\nMichelleview, NJ 43124         70.0
19        20             417 Ray Trail\nAndersonmouth, AR 40879         70.0
20        21  7653 Vaughn Stream Suite 982\nLake Kathyside, ...         70.0
21        22                   Unit 2038 Box 7064\nDPO AE 64593         70.0
22        23        35783 Amber Highway\nPort Ianfurt, DE 85703         70.0
23        24          5815 Wolf Via\nNorth Nicoleland, IN 78109         70.0
24        25                          USNS French\nFPO AA 42194         70.0
25        26  2270 Hopkins Coves Suite 360\nMatthewton, NE 6...         73.0
26        27          050 Lopez Spring\nWest Maryport, CT 10905         75.0
27        28   41102 Timothy Mountain\nWest Alexhaven, HI 09554         75.0
28        29  63343 Michael Spur Apt. 663\nSouth Jennifer, O...         75.0
29        30                   PSC 3631, Box 0160\nAPO AE 85245         75.0
30        31         219 Andre Shoal\nWest Kathrynton, MD 45754         75.0
31        32      9040 Leblanc Canyon\nGabrielborough, MD 81094         80.0
32        33  382 Reyes Bridge Apt. 682\nPort Stephen, SC 37996         80.0
33        34          2219 Matthew Island\nRhondaland, DE 01336         80.0
34        35  641 Morrison Forges Apt. 087\nEast Jennifervie...         80.0
35        36           0386 Mckay Plains\nNorth Erica, MD 45002         80.0
36        37   72001 Hill Greens Suite 216\nPatelbury, MA 74804         80.0
37        38          28306 Hodge River\nStephenville, AK 52107         80.0
38        39          745 Sharp Prairie\nSouth Steven, IA 85101         82.0
39        40           136 Garcia Plain\nWest Heather, NM 88649         83.0
40        41  17009 Shelby Court Suite 424\nNew Jenniferfurt...         84.0
41        42   2731 Tyler Spurs Suite 572\nJosephfurt, AS 72150         85.0
42        43         362 Sherman Burg\nPort Alejandro, AS 24307         85.0
43        44  3008 Walker Forge Suite 715\nEast Meganfort, M...         86.0
44        45    7545 Davis Drive Suite 424\nMasonside, KY 14942         90.0
45        46            93981 Dean Cliff\nNorth Becky, OK 01751         90.0
46        47   5581 Rojas Avenue Apt. 292\nAyersburgh, MO 36844         90.0
47        48  773 Brandy Villages Apt. 694\nHernandezland, N...         90.0
48        49  3977 Baker Meadow Suite 458\nWest Tiffany, DC ...         90.0
49        50            642 Cindy Union\nWallaceburgh, AK 61871         95.0

   Construction_type  Estimated_market_value  Year_built  Holder_id    LoanId
0                New                  450622           2         42  LP001177
1                Old                  321747          18         11  LP001211
2                New                   93303           8         11  LP001051
3                New                  428373           4         27  LP001115
4                New                  361192           2          1  LP001082
5                Old                  315519          19         47  LP001051
6                New                   59893          10         36  LP001270
7                Old                   69443          15         50  LP001121
8                New                  290560           4         42  LP001015
9                Old                   53307          15         15  LP001056
10               New                  464263           5         33  LP001187
11               Old                  366989          14         11  LP001015
12               Old                  249549          11         13  LP001284
13               Old                  273639          20         48  LP001124
14               Old                  328137          13         29  LP001121
15               Old                  185267          17         48  LP001096
16               Old                  492915          12         15  LP001054
17               New                  342244           4         29  LP001176
18               Old                  224774          17         21  LP001177
19               New                   67592           1         47  LP001135
20               Old                  337652          12          8  LP001121
21               Old                   91851          13         21  LP001105
22               Old                  414380          15         19  LP001051
23               Old                  390197          13         41  LP001174
24               New                  374406           3         43  LP001291
25               Old                  121602          17         40  LP001183
26               New                  349179           6         39  LP001231
27               Old                  140179          12         41  LP001219
28               New                  444146           1         15  LP001031
29               New                  468881           4         34  LP001035
30               Old                  214312          19         23  LP001190
31               New                  318681           1          5  LP001054
32               New                  106127           3         46  LP001056
33               Old                  256767          18         36  LP001174
34               New                  496832           1         46  LP001022
35               New                  482604           1          7  LP001203
36               New                  391848           1          4  LP001135
37               New                   69468           7         22  LP001149
38               Old                  141166          16          7  LP001124
39               Old                  301471          16          4  LP001124
40               Old                  360897          12         11  LP001208
41               New                  232975           2         36  LP001015
42               New                  464857          10         26  LP001169
43               New                  133442           1         43  LP001096
44               Old                  274577          19         24  LP001035
45               New                  457625           3         38  LP001210
46               New                  272200           9         50  LP001163
47               Old                  368014          20         42  LP001153
48               New                  122151           6          3  LP001107
49               New                  495212          10         30  LP001174

In [30]:
#creating INSERT SQL file for Home_Details table
for Asset_id, Address, Carpet_area, Construction_type, Estimated_market_value, Year_built, Holder_id, LoanId  in new_df.values.tolist():
    print("INSERT INTO Home_Details VALUES ({},'{}',{},'{}',{},{},{},'{}');".format(Asset_id, Address, Carpet_area, Construction_type, Estimated_market_value, Year_built, Holder_id, LoanId))

INSERT INTO Home_Details VALUES (1,'369 Nicole Courts Apt. 390
Sotofurt, MP 46969',40.0,'New',450622,2,42,'LP001177');
INSERT INTO Home_Details VALUES (2,'88846 Michael Rapid Apt. 509
New Ryanfurt, NY 09603',42.0,'Old',321747,18,11,'LP001211');
INSERT INTO Home_Details VALUES (3,'58138 Paul Trail
Port Kristen, PA 22627',45.0,'New',93303,8,11,'LP001051');
INSERT INTO Home_Details VALUES (4,'125 Wyatt Fords Suite 874
Lake Emily, NM 03235',46.0,'New',428373,4,27,'LP001115');
INSERT INTO Home_Details VALUES (5,'63759 Graham Wells Suite 913
Millerchester, MH 95793',55.0,'New',361192,2,1,'LP001082');
INSERT INTO Home_Details VALUES (6,'96275 Brian Lakes Apt. 664
Melissamouth, VT 06002',55.0,'Old',315519,19,47,'LP001051');
INSERT INTO Home_Details VALUES (7,'PSC 7700, Box 1021
APO AE 97757',60.0,'New',59893,10,36,'LP001270');
INSERT INTO Home_Details VALUES (8,'0033 Chan Hills Apt. 643
New Rogerton, CO 94460',62.0,'Old',69443,15,50,'LP001121');
INSERT INTO Home_Details VALUES (9,'2657 Rebecca Locks Suite 354
Garrettton, MP 85073',64.0,'New',290560,4,42,'LP001015');
INSERT INTO Home_Details VALUES (10,'650 West Orchard
Cynthiafurt, UT 50554',65.0,'Old',53307,15,15,'LP001056');
INSERT INTO Home_Details VALUES (11,'821 Jill Light Suite 863
Carrilloside, KS 06662',65.0,'New',464263,5,33,'LP001187');
INSERT INTO Home_Details VALUES (12,'521 Robin Motorway
Christineberg, AS 64097',65.0,'Old',366989,14,11,'LP001015');
INSERT INTO Home_Details VALUES (13,'20126 Kathryn Mission Suite 582
New Jaredchester, MO 00733',65.0,'Old',249549,11,13,'LP001284');
INSERT INTO Home_Details VALUES (14,'0622 Jones Greens
Andreachester, WV 71705',65.0,'Old',273639,20,48,'LP001124');
INSERT INTO Home_Details VALUES (15,'832 Daniel Motorway Suite 328
Amandaton, NY 72196',65.0,'Old',328137,13,29,'LP001121');
INSERT INTO Home_Details VALUES (16,'Unit 1246 Box 9663
DPO AE 12049',65.0,'Old',185267,17,48,'LP001096');
INSERT INTO Home_Details VALUES (17,'32531 Mclean Street
East Williammouth, UT 28268',67.0,'Old',492915,12,15,'LP001054');
INSERT INTO Home_Details VALUES (18,'23637 Monica Streets Suite 959
South Randall, WA 84130',68.0,'New',342244,4,29,'LP001176');
INSERT INTO Home_Details VALUES (19,'3901 Adam Branch
Michelleview, NJ 43124',70.0,'Old',224774,17,21,'LP001177');
INSERT INTO Home_Details VALUES (20,'417 Ray Trail
Andersonmouth, AR 40879',70.0,'New',67592,1,47,'LP001135');
INSERT INTO Home_Details VALUES (21,'7653 Vaughn Stream Suite 982
Lake Kathyside, NC 62080',70.0,'Old',337652,12,8,'LP001121');
INSERT INTO Home_Details VALUES (22,'Unit 2038 Box 7064
DPO AE 64593',70.0,'Old',91851,13,21,'LP001105');
INSERT INTO Home_Details VALUES (23,'35783 Amber Highway
Port Ianfurt, DE 85703',70.0,'Old',414380,15,19,'LP001051');
INSERT INTO Home_Details VALUES (24,'5815 Wolf Via
North Nicoleland, IN 78109',70.0,'Old',390197,13,41,'LP001174');
INSERT INTO Home_Details VALUES (25,'USNS French
FPO AA 42194',70.0,'New',374406,3,43,'LP001291');
INSERT INTO Home_Details VALUES (26,'2270 Hopkins Coves Suite 360
Matthewton, NE 63831',73.0,'Old',121602,17,40,'LP001183');
INSERT INTO Home_Details VALUES (27,'050 Lopez Spring
West Maryport, CT 10905',75.0,'New',349179,6,39,'LP001231');
INSERT INTO Home_Details VALUES (28,'41102 Timothy Mountain
West Alexhaven, HI 09554',75.0,'Old',140179,12,41,'LP001219');
INSERT INTO Home_Details VALUES (29,'63343 Michael Spur Apt. 663
South Jennifer, OH 62658',75.0,'New',444146,1,15,'LP001031');
INSERT INTO Home_Details VALUES (30,'PSC 3631, Box 0160
APO AE 85245',75.0,'New',468881,4,34,'LP001035');
INSERT INTO Home_Details VALUES (31,'219 Andre Shoal
West Kathrynton, MD 45754',75.0,'Old',214312,19,23,'LP001190');
INSERT INTO Home_Details VALUES (32,'9040 Leblanc Canyon
Gabrielborough, MD 81094',80.0,'New',318681,1,5,'LP001054');
INSERT INTO Home_Details VALUES (33,'382 Reyes Bridge Apt. 682
Port Stephen, SC 37996',80.0,'New',106127,3,46,'LP001056');
INSERT INTO Home_Details VALUES (34,'2219 Matthew Island
Rhondaland, DE 01336',80.0,'Old',256767,18,36,'LP001174');
INSERT INTO Home_Details VALUES (35,'641 Morrison Forges Apt. 087
East Jenniferview, RI 26167',80.0,'New',496832,1,46,'LP001022');
INSERT INTO Home_Details VALUES (36,'0386 Mckay Plains
North Erica, MD 45002',80.0,'New',482604,1,7,'LP001203');
INSERT INTO Home_Details VALUES (37,'72001 Hill Greens Suite 216
Patelbury, MA 74804',80.0,'New',391848,1,4,'LP001135');
INSERT INTO Home_Details VALUES (38,'28306 Hodge River
Stephenville, AK 52107',80.0,'New',69468,7,22,'LP001149');
INSERT INTO Home_Details VALUES (39,'745 Sharp Prairie
South Steven, IA 85101',82.0,'Old',141166,16,7,'LP001124');
INSERT INTO Home_Details VALUES (40,'136 Garcia Plain
West Heather, NM 88649',83.0,'Old',301471,16,4,'LP001124');
INSERT INTO Home_Details VALUES (41,'17009 Shelby Court Suite 424
New Jenniferfurt, DC 11319',84.0,'Old',360897,12,11,'LP001208');
INSERT INTO Home_Details VALUES (42,'2731 Tyler Spurs Suite 572
Josephfurt, AS 72150',85.0,'New',232975,2,36,'LP001015');
INSERT INTO Home_Details VALUES (43,'362 Sherman Burg
Port Alejandro, AS 24307',85.0,'New',464857,10,26,'LP001169');
INSERT INTO Home_Details VALUES (44,'3008 Walker Forge Suite 715
East Meganfort, MD 60946',86.0,'New',133442,1,43,'LP001096');
INSERT INTO Home_Details VALUES (45,'7545 Davis Drive Suite 424
Masonside, KY 14942',90.0,'Old',274577,19,24,'LP001035');
INSERT INTO Home_Details VALUES (46,'93981 Dean Cliff
North Becky, OK 01751',90.0,'New',457625,3,38,'LP001210');
INSERT INTO Home_Details VALUES (47,'5581 Rojas Avenue Apt. 292
Ayersburgh, MO 36844',90.0,'New',272200,9,50,'LP001163');
INSERT INTO Home_Details VALUES (48,'773 Brandy Villages Apt. 694
Hernandezland, NM 57251',90.0,'Old',368014,20,42,'LP001153');
INSERT INTO Home_Details VALUES (49,'3977 Baker Meadow Suite 458
West Tiffany, DC 24931',90.0,'New',122151,6,3,'LP001107');
INSERT INTO Home_Details VALUES (50,'642 Cindy Union
Wallaceburgh, AK 61871',95.0,'New',495212,10,30,'LP001174');

In [35]:
#working on Claim table

import pandas as pd
import numpy as np
import random
from faker import Faker

# Set the seed for reproducibility
np.random.seed(42)
random.seed(42)

# Generate random data for the Claim table
fake = Faker()
num_records = 50  # Limit to 50 rows

# Generate random Claim_id, Claim_amount, Date, and Holder_id
claim_ids = np.random.randint(1000, 10000, num_records)
claim_amounts = np.random.randint(1000, 50000, num_records)
dates = pd.date_range(start='2022-01-01', end='2023-12-31', periods=num_records)
holder_ids = random.choices(range(1, 51), k=num_records)

# Create a DataFrame with the generated data
claim_data = pd.DataFrame({
    'Claim_id': claim_ids,
    'Claim_amount': claim_amounts,
    'Date': dates,
    'Holder_id': holder_ids
})

# Format the Date column to YYYY-MM-DD
claim_data['Date'] = claim_data['Date'].dt.strftime('%Y-%m-%d')

# Print or use the resulting DataFrame as needed
print(claim_data)

claim_data.to_csv('Claim.csv', index=False)

    Claim_id  Claim_amount        Date  Holder_id
0       8270          4943  2022-01-01         32
1       1860         24939  2022-01-15          2
2       6390         20457  2022-01-30         14
3       6191          2021  2022-02-14         12
4       6734         12653  2022-03-01         37
5       7265         44573  2022-03-16         34
6       1466         14417  2022-03-31         45
7       5426         41757  2022-04-15          5
8       6578         10692  2022-04-30         22
9       9322         46758  2022-05-14          2
10      2685          7873  2022-05-29         11
11      1769          6675  2022-06-13         26
12      7949          1161  2022-06-28          2
13      3433         38065  2022-07-13         10
14      6311         27557  2022-07-28         33
15      6051         34763  2022-08-12         28
16      7420         33606  2022-08-27         12
17      2184         12534  2022-09-10         30
18      5555         30127  2022-09-25         41
19      4385         41397  2022-10-10          1
20      7396         26851  2022-10-25         41
21      9666          2016  2022-11-09         35
22      3558         25253  2022-11-24         18
23      8849         25276  2022-12-09          8
24      3047         24247  2022-12-24         48
25      3747         25300  2023-01-07         17
26      1189          9529  2023-01-22          5
27      3734         18262  2023-02-06          5
28      4005         10268  2023-02-21         43
29      5658         22271  2023-03-08         31
30      2899         13185  2023-03-23         41
31      8734         22243  2023-04-07         37
32      2267         40099  2023-04-22         27
33      2528          9571  2023-05-06         49
34      4556         40976  2023-05-21         19
35      4890         39044  2023-06-05         28
36      9838         49984  2023-06-20         42
37      6393         41774  2023-07-05         31
38      9792          3568  2023-07-20         44
39      9433          3027  2023-08-04         29
40      8513          3695  2023-08-19         36
41      3612         49190  2023-09-02          3
42      8041          6258  2023-09-17         12
43      7235         23002  2023-10-02         15
44      6486         40504  2023-10-17          4
45      8099         34159  2023-11-01         12
46      1775         14986  2023-11-16          6
47      9226         13666  2023-12-01         14
48      4152         39660  2023-12-16         32
49      2585          4561  2023-12-31         19

In [36]:
#creating INSERT SQL file for Claim table
for Claim_id, Claim_amount, Date, Holder_id  in claim_data.values.tolist():
    print("INSERT INTO Claim VALUES ({},{},'{}',{});".format(Claim_id, Claim_amount, Date, Holder_id))

INSERT INTO Claim VALUES (8270,4943,'2022-01-01',32);
INSERT INTO Claim VALUES (1860,24939,'2022-01-15',2);
INSERT INTO Claim VALUES (6390,20457,'2022-01-30',14);
INSERT INTO Claim VALUES (6191,2021,'2022-02-14',12);
INSERT INTO Claim VALUES (6734,12653,'2022-03-01',37);
INSERT INTO Claim VALUES (7265,44573,'2022-03-16',34);
INSERT INTO Claim VALUES (1466,14417,'2022-03-31',45);
INSERT INTO Claim VALUES (5426,41757,'2022-04-15',5);
INSERT INTO Claim VALUES (6578,10692,'2022-04-30',22);
INSERT INTO Claim VALUES (9322,46758,'2022-05-14',2);
INSERT INTO Claim VALUES (2685,7873,'2022-05-29',11);
INSERT INTO Claim VALUES (1769,6675,'2022-06-13',26);
INSERT INTO Claim VALUES (7949,1161,'2022-06-28',2);
INSERT INTO Claim VALUES (3433,38065,'2022-07-13',10);
INSERT INTO Claim VALUES (6311,27557,'2022-07-28',33);
INSERT INTO Claim VALUES (6051,34763,'2022-08-12',28);
INSERT INTO Claim VALUES (7420,33606,'2022-08-27',12);
INSERT INTO Claim VALUES (2184,12534,'2022-09-10',30);
INSERT INTO Claim VALUES (5555,30127,'2022-09-25',41);
INSERT INTO Claim VALUES (4385,41397,'2022-10-10',1);
INSERT INTO Claim VALUES (7396,26851,'2022-10-25',41);
INSERT INTO Claim VALUES (9666,2016,'2022-11-09',35);
INSERT INTO Claim VALUES (3558,25253,'2022-11-24',18);
INSERT INTO Claim VALUES (8849,25276,'2022-12-09',8);
INSERT INTO Claim VALUES (3047,24247,'2022-12-24',48);
INSERT INTO Claim VALUES (3747,25300,'2023-01-07',17);
INSERT INTO Claim VALUES (1189,9529,'2023-01-22',5);
INSERT INTO Claim VALUES (3734,18262,'2023-02-06',5);
INSERT INTO Claim VALUES (4005,10268,'2023-02-21',43);
INSERT INTO Claim VALUES (5658,22271,'2023-03-08',31);
INSERT INTO Claim VALUES (2899,13185,'2023-03-23',41);
INSERT INTO Claim VALUES (8734,22243,'2023-04-07',37);
INSERT INTO Claim VALUES (2267,40099,'2023-04-22',27);
INSERT INTO Claim VALUES (2528,9571,'2023-05-06',49);
INSERT INTO Claim VALUES (4556,40976,'2023-05-21',19);
INSERT INTO Claim VALUES (4890,39044,'2023-06-05',28);
INSERT INTO Claim VALUES (9838,49984,'2023-06-20',42);
INSERT INTO Claim VALUES (6393,41774,'2023-07-05',31);
INSERT INTO Claim VALUES (9792,3568,'2023-07-20',44);
INSERT INTO Claim VALUES (9433,3027,'2023-08-04',29);
INSERT INTO Claim VALUES (8513,3695,'2023-08-19',36);
INSERT INTO Claim VALUES (3612,49190,'2023-09-02',3);
INSERT INTO Claim VALUES (8041,6258,'2023-09-17',12);
INSERT INTO Claim VALUES (7235,23002,'2023-10-02',15);
INSERT INTO Claim VALUES (6486,40504,'2023-10-17',4);
INSERT INTO Claim VALUES (8099,34159,'2023-11-01',12);
INSERT INTO Claim VALUES (1775,14986,'2023-11-16',6);
INSERT INTO Claim VALUES (9226,13666,'2023-12-01',14);
INSERT INTO Claim VALUES (4152,39660,'2023-12-16',32);
INSERT INTO Claim VALUES (2585,4561,'2023-12-31',19);

In [37]:
df_temp = pd.read_csv('customer.csv')
df_temp = df_temp['id']
df_temp.to_csv('/Users/karanbadlani/Library/Mobile Documents/com~apple~CloudDocs/Desktop/temp.csv', index=False)

In [39]:
#working on Transactions Table
# I'll be populating some columns from a Andhra_Health_Data.csv and some columns will be generated manually
# reference - https://www.kaggle.com/datasets/phiitm/andhra-pradesh-health-data
import pandas as pd
import numpy as np
import random

# Read data from Andhra_Health_Data.csv
health_data = pd.read_csv('Andhra_Health_Data.csv')

# Define lists for customer_id and holder_id
customer_ids = [987673, 352841, 554593, 778711, 78932, 319355, 719439, 538409, 979749, 640537,
                871428, 847339, 94613, 628418, 974101, 930301, 915790, 389080, 336850, 176254,
                638484, 621200, 555849, 972654, 492977, 77471, 289060, 166248, 830875, 591642,
                293654, 532909, 109075, 174408, 632251, 981115, 58082, 499661, 950610, 358893,
                867938, 114971, 365390, 872585, 144402, 345273, 415216, 733572, 74341, 249650]

holder_ids = list(range(1, 51))

# Generate random data for other columns
num_transactions = len(health_data)
transaction_ids = [str(random.randint(0, 999999)).zfill(6) for _ in range(num_transactions)]
dates = pd.to_datetime(health_data['CLAIM_DATE']).dt.date
status_of_transactions = random.choices(['Completed', 'Pending', 'Failed'], k=num_transactions)
amounts = np.random.randint(1000, 50000, num_transactions)
customer_ids_random = random.choices(customer_ids, k=num_transactions)
holder_ids_random = random.choices(holder_ids, k=num_transactions)

# Create the Transactions DataFrame
transactions_data = pd.DataFrame({
    'Transaction_id': transaction_ids,
    'Date': dates,
    'status_of_transaction': status_of_transactions,
    'Amount': amounts,
    'Customer_id': customer_ids_random,
    'Holder_id': holder_ids_random
})

# Save only 50 random rows to a CSV file
transactions_data_50_rows = transactions_data.sample(n=50)
transactions_data_50_rows.to_csv('Transactions.csv', index=False)

# Print or use the resulting DataFrame as needed
print(transactions_data_50_rows)

       Transaction_id        Date status_of_transaction  Amount  Customer_id  \
405253         098725  2017-03-10               Pending   49668       632251
151544         603071  2017-03-21               Pending   18303       915790
426715         136633  2017-07-11                Failed   16434       847339
222061         152754  2017-04-29                Failed   46570       867938
266453         616393  2017-05-16                Failed   44055       166248
335989         926484  2017-05-08             Completed   15151       174408
97388          205872  2017-10-01                Failed    2756       365390
303029         586079  2017-07-28                Failed   24303       358893
75745          028129  2017-01-31                Failed   29118       166248
189429         793896  2017-09-05                Failed    6691       591642
80497          830021  2017-01-20             Completed   17164       628418
124804         726836  2017-08-30               Pending   26063       336850
41887          775668  2017-10-01                Failed   33701       176254
350053         254957  2017-08-19               Pending   14749       358893
315587         189198  2017-08-19             Completed   24353       638484
11952          454793  2017-06-09               Pending    1660       554593
63008          271127  2017-09-01                Failed   12003       981115
403690         309030  2017-10-21               Pending   16926       166248
213659         409634  2017-09-05               Pending   23282       950610
306800         557235  2017-02-08             Completed   30481       176254
306540         451003  2017-11-10                Failed   37036       415216
22531          132434  2017-04-01               Pending    1420       987673
277639         797901  2017-11-21             Completed   37535       867938
435962         603560  2017-12-30                Failed   44263       867938
353425         651645  2017-08-17                Failed   45991       867938
21565          306533  2017-06-01             Completed   40435       871428
195155         614899  2017-09-05             Completed   35387       555849
48866          388314  2017-01-20             Completed   46863       352841
247835         269945  2017-10-17               Pending    6350       389080
220368         466018  2017-04-13               Pending   26411       867938
313004         666273  2017-04-07             Completed   19758       415216
87138          546336  2017-10-02               Pending    2896       389080
236755         651163  2017-05-23             Completed    9155       365390
298584         775830  2017-03-10                Failed    6818       591642
33183          321230  2017-08-30                Failed   31943       621200
278925         570276  2017-05-19                Failed   45002       847339
251336         468560  2017-03-05                Failed   23737       174408
364890         273256  2017-08-30             Completed   15958       554593
186966         395515  2017-05-19               Pending   48261       638484
271953         613772  2017-05-16                Failed   42766       591642
275056         943192  2017-04-07               Pending   43681       628418
192841         056476  2017-04-17               Pending   15107       628418
143798         865643  2017-06-03               Pending    8480       733572
147476         221016  2017-06-09                Failed   26937       492977
435692         781085  2017-10-17             Completed   37479       289060
411873         299534  2017-07-10             Completed   21790       915790
479224         674674  2017-12-29               Pending    5244        77471
403800         661066  2017-03-10                Failed   18612       114971
73040          082963  2017-11-01                Failed    6382       632251
246787         729563  2017-12-05                Failed    1872       114971

        Holder_id
405253         27
151544         28
426715         21
222061          2
266453         14
335989          6
97388          30
303029         15
75745           2
189429         20
80497          14
124804         24
41887          50
350053         18
315587          9
11952          34
63008          36
403690         43
213659         21
306800          4
306540         31
22531          41
277639         17
435962         19
353425         33
21565          41
195155         26
48866          29
247835         27
220368         50
313004         11
87138          32
236755          7
298584          3
33183           6
278925         40
251336         20
364890         16
186966         33
271953         23
275056          9
192841         29
143798         11
147476          6
435692          3
411873         26
479224         45
403800         22
73040          12
246787         42

In [40]:
transactions_data_50_rows.columns

Index(['Transaction_id', 'Date', 'status_of_transaction', 'Amount',
       'Customer_id', 'Holder_id'],
      dtype='object')

In [41]:
#creating INSERT SQL file for Transactions table
for Transaction_id, Date, status_of_transaction, Amount, Customer_id, Holder_id  in transactions_data_50_rows.values.tolist():
    print("INSERT INTO Transactions VALUES ({},'{}','{}',{},{},{});".format(Transaction_id, Date, status_of_transaction, Amount, Customer_id, Holder_id))

INSERT INTO Transactions VALUES (098725,'2017-03-10','Pending',49668,632251,27);
INSERT INTO Transactions VALUES (603071,'2017-03-21','Pending',18303,915790,28);
INSERT INTO Transactions VALUES (136633,'2017-07-11','Failed',16434,847339,21);
INSERT INTO Transactions VALUES (152754,'2017-04-29','Failed',46570,867938,2);
INSERT INTO Transactions VALUES (616393,'2017-05-16','Failed',44055,166248,14);
INSERT INTO Transactions VALUES (926484,'2017-05-08','Completed',15151,174408,6);
INSERT INTO Transactions VALUES (205872,'2017-10-01','Failed',2756,365390,30);
INSERT INTO Transactions VALUES (586079,'2017-07-28','Failed',24303,358893,15);
INSERT INTO Transactions VALUES (028129,'2017-01-31','Failed',29118,166248,2);
INSERT INTO Transactions VALUES (793896,'2017-09-05','Failed',6691,591642,20);
INSERT INTO Transactions VALUES (830021,'2017-01-20','Completed',17164,628418,14);
INSERT INTO Transactions VALUES (726836,'2017-08-30','Pending',26063,336850,24);
INSERT INTO Transactions VALUES (775668,'2017-10-01','Failed',33701,176254,50);
INSERT INTO Transactions VALUES (254957,'2017-08-19','Pending',14749,358893,18);
INSERT INTO Transactions VALUES (189198,'2017-08-19','Completed',24353,638484,9);
INSERT INTO Transactions VALUES (454793,'2017-06-09','Pending',1660,554593,34);
INSERT INTO Transactions VALUES (271127,'2017-09-01','Failed',12003,981115,36);
INSERT INTO Transactions VALUES (309030,'2017-10-21','Pending',16926,166248,43);
INSERT INTO Transactions VALUES (409634,'2017-09-05','Pending',23282,950610,21);
INSERT INTO Transactions VALUES (557235,'2017-02-08','Completed',30481,176254,4);
INSERT INTO Transactions VALUES (451003,'2017-11-10','Failed',37036,415216,31);
INSERT INTO Transactions VALUES (132434,'2017-04-01','Pending',1420,987673,41);
INSERT INTO Transactions VALUES (797901,'2017-11-21','Completed',37535,867938,17);
INSERT INTO Transactions VALUES (603560,'2017-12-30','Failed',44263,867938,19);
INSERT INTO Transactions VALUES (651645,'2017-08-17','Failed',45991,867938,33);
INSERT INTO Transactions VALUES (306533,'2017-06-01','Completed',40435,871428,41);
INSERT INTO Transactions VALUES (614899,'2017-09-05','Completed',35387,555849,26);
INSERT INTO Transactions VALUES (388314,'2017-01-20','Completed',46863,352841,29);
INSERT INTO Transactions VALUES (269945,'2017-10-17','Pending',6350,389080,27);
INSERT INTO Transactions VALUES (466018,'2017-04-13','Pending',26411,867938,50);
INSERT INTO Transactions VALUES (666273,'2017-04-07','Completed',19758,415216,11);
INSERT INTO Transactions VALUES (546336,'2017-10-02','Pending',2896,389080,32);
INSERT INTO Transactions VALUES (651163,'2017-05-23','Completed',9155,365390,7);
INSERT INTO Transactions VALUES (775830,'2017-03-10','Failed',6818,591642,3);
INSERT INTO Transactions VALUES (321230,'2017-08-30','Failed',31943,621200,6);
INSERT INTO Transactions VALUES (570276,'2017-05-19','Failed',45002,847339,40);
INSERT INTO Transactions VALUES (468560,'2017-03-05','Failed',23737,174408,20);
INSERT INTO Transactions VALUES (273256,'2017-08-30','Completed',15958,554593,16);
INSERT INTO Transactions VALUES (395515,'2017-05-19','Pending',48261,638484,33);
INSERT INTO Transactions VALUES (613772,'2017-05-16','Failed',42766,591642,23);
INSERT INTO Transactions VALUES (943192,'2017-04-07','Pending',43681,628418,9);
INSERT INTO Transactions VALUES (056476,'2017-04-17','Pending',15107,628418,29);
INSERT INTO Transactions VALUES (865643,'2017-06-03','Pending',8480,733572,11);
INSERT INTO Transactions VALUES (221016,'2017-06-09','Failed',26937,492977,6);
INSERT INTO Transactions VALUES (781085,'2017-10-17','Completed',37479,289060,3);
INSERT INTO Transactions VALUES (299534,'2017-07-10','Completed',21790,915790,26);
INSERT INTO Transactions VALUES (674674,'2017-12-29','Pending',5244,77471,45);
INSERT INTO Transactions VALUES (661066,'2017-03-10','Failed',18612,114971,22);
INSERT INTO Transactions VALUES (082963,'2017-11-01','Failed',6382,632251,12);
INSERT INTO Transactions VALUES (729563,'2017-12-05','Failed',1872,114971,42);